[
    {
        "name": "Elegaius",
        "lore": "Countless horrors stalk Teleria. Many are the legends of monsters and evil spirits whispered among terrified mortals. As winter approaches and days grow shorter, these tales are ever more frequent - for the night of all unholy is upon us. But even now, with frightening fables so abundant, few dare speak of Elegaius, for her very name makes heroes and peasants alike tremble in fear.\nIt is a legend originating from millennia past, long before the Stormwind Wastelands earned their name. Back in those blessed days, it was a fertile plain, home to many budding realms where wealthy rulers sought to outdo one another in splendor. Among them, one Archon had decreed that he was the most pious of all his rivals and ordered to raise a Temple of Lumaya, the likes of which Teleria had never seen.\nIt was a mighty undertaking that drained the treasury and nearly led to a revolt when extortionate taxes were imposed on the citizenry, but, slowly, the construction went underway. Alas, blinded by hubris, the ambitious Archon failed to see the rot of corruption that had already poisoned his court.\nElegaius, the High Priestess of Lumaya, had long lost her faith in the Goddess and fell under the sway of evil. The necromancers in service to Siroth opened her eyes and taught her the ways of ancient dark magic, one that would let Elegaius obtain power beyond her wildest dreams. And so she struck a terrible pact that would doom the entire city.\nAs the construction of Lumaya’s grand cathedral went on, Elegaius committed countless atrocities in secret. She performed blood rituals, immured innocents within walls, desecrated relics, all while her supposed sovereign feasted and bragged about his religious fervor. The gears were in motion, and no one could stop her schemes from coming to fruition.\nAt last, the day had come when the temple stood completed - so beautiful it brought grown men to tears. Proud of his achievements, the Archon called for a mass that would bring Lumaya’s blessings upon him. The entire city gathered as one, filling the temple and the plaza outside with a thousand-strong crowd that hushed in reverent silence when the High Priestess addressed them and called for prayer. That is when the horror began.\nThe psalms of love and light changed, growing more vicious with every verse until not a single soul among the congregation could understand the language in which Elegaius chanted. No one could move a muscle, mesmerized by the strange incantation. Suddenly, a dagger of black steel flashed from beneath the Priestess’ robes. She drove it through her own heart, thus giving one last sacrifice to the Dark One, yet death did not claim her.\nWith a shriek of agony, Elegaius’ body twisted, aging by decades until it started to rot like a bloated corpse. A shockwave of arcane energy erupted from the dagger in her hands, its touch turning people to withered husks as their souls were drained. Within a minute, none but the creature that was once Elegaius remained - an entire city gone, turned to a terrible monument of Siroth’s dark glory.\nBut nothing lasts beneath the moon, and the weight of time had long reduced the once-proud city to ruin. Those who venture into this cursed wasteland speak of tortured shrieks that echo amid the broken walls of the temple that was to be the envy of entire Teleria. Legends say that the High Priestess Elegaius still dwells there, feeding on anyone foolish enough to enter her domain and patiently waiting for the new coming of her Master’s legions into the world. Woe betide those who cross her path, for this is a monster of ancient power. Even the mightiest Champions will be sorely tested against a foe such as this.\n",
        "image": "",
        "link": "https://fb.watch/4Q8OFqOXCN/"
    },
    {
        "name": "Iron Brago",
        "lore": "Before the days of the Kingdom of Kaerok, before the High Elves of Aravia recovered from their disastrous civil war, the Orcs were a power to be reckoned with. Once slaves to Shadow, they cast off the yoke of Siroth with the Arbiter’s help and scattered across the continents. Tough, warlike, and nomadic, they were uneasy neighbors at the best of times, yet true danger became apparent when leaders rose among the Orcs. Leaders strong enough to unite the fractured tribes. Leaders like Iron Brago.\nAs the youngest son of a respected chieftain, Brago never had had real hope of taking his father’s place as the leader of the tribe. Fortunately, ancestors had blessed him with the strength of a mountain and the temper of a wild boar. These qualities made it easy for Brago to embrace his lot as a warrior with all the savage enthusiasm expected of an Orc.\nBut where Brago excelled, his brothers were anything but gifted. They watched with jealousy as their sibling’s reputation grew with every foe he defeated, every raid rich in slaves and spoils, and they feared the others would see Brago as the only worthy heir. That was not something the brothers could allow, even if it meant murdering their kin.\nFirst, they poisoned their elderly father before he could name a successor. Then they pretended to mourn as all good sons should, inviting Brago to join them at the funeral feast as an equal. Tradition forbade the spilling of blood in the sight of honored dead, and thus everyone in attendance had to come unarmed. In the middle of the feast, the brothers revealed their true colors and unsheathed the swords they had concealed earlier, striking at their youngest sibling in a bid to slay him while he was unarmed. It was a brutal clash that cost Brago an eye, but such was his ferocity in the face of betrayal that he fought and killed his craven kin barehanded.\nNews of the massacre spread quickly, and the tribe was unanimous in their support of Brago’s right to take his father’s place. They recognized both the wrongs done against him and shared fearful respect for a warrior of such renown - a virtue every Orc wishes to see in their leader. Brago did not disappoint. He led a brutal campaign against neighboring tribes and brought the survivors under his banner. Within a decade, a horde of six thousand Orcish warriors stood ready to fulfill their chieftain’s whims.\nMany attempted to best the legendary Orc leader in combat, others sought to assassinate him. None survived their attempts, while Iron Brago’s infamy spread far and wide. Desperate alliances of barbarian clans and several Elven hosts sought to drive Brago’s army back into the Krokhan Desert, yet he crushed them all in battle one by one. The path to the capital of Aravia lay open, and for the first time in generations, there was a real chance the jewel of the Elven realm could be ransacked by the savage hordes from the east.\nSalvation for the High Elves took a rather unexpected form. A messenger arrived at Brago’s encampment when he was a mere week’s march away from the city, and the news he brought was dire - raiding parties of the vile Knights Revenant cult targetted Orc tribes back in the Deadlands. There were not warriors enough left to defend the old and the young; thus the death cultists and their undead thralls rampaged across settlements unchallenged, killing and enslaving at will. Enraged, Iron Brago ordered the entire horde to turn around and make haste home to deal with this newfound threat.\nNo written accounts exist of what had transpired, but Orc sagas speak of a war that blazed across the eastern continent. Brago, they claimed, drove his army into the very heart of the Stormwind Wastelands, swept aside swarms of the living dead, and had personally defeated a mighty vampire lord in single combat. Whether these tales are exaggerated or not, one thing is certain - Iron Brago never returned from that campaign, and none of his surviving warriors knew what happened to him.\nHowever, there are reported sightings of a one-eyed Orc warrior clad in grotesque armor, allegedly traveling in the company of Champions who fought for the Arbiter. Could it be that the scourge of the Eastlands had been chosen to ascend into Lumaya’s service? Only the Arbiter herself may know, but stranger alliances had to be made in defense of Teleria.",
        "image": "",
        "link": "https://fb.watch/4Q98-x-Ou1/"
    },
    {
        "name": "Lydia the Death Siren",
        "lore": "In the blessed days before the Elvish people were torn in twain by the great schism, there lived a sorceress as fierce as she was wise. Known by her given name of Lydia, she was famed for her mastery of the arcane, and many a-noble sought her counsel on matters both political and spiritual. Yet, for all her virtue, there was one thing the great sorceress feared above all. Death.\nEven the long life of an elf comes to an end one day, but Lydia’s pride would not allow her to accept the inevitable. It was this hubris that the servants of Siroth used. Recognized and targetted by corrupt nobles, Lydia found herself subtly nudged towards the study of forbidden lore.\nWhere many of her peers sought to control death through the vile art of necromancy, Lydia’s gaze turned towards blood magic - for blood was surely the source from which life sprung. In time, her desire to learn turned into a fell obsession that led the sorceress to commit horrible atrocities in the name of eternal life. The rot of evil poisoned her heart, ensuring she threw her lot in with the rebel dark mages when they finally revealed themselves. In response, the Basileus sent a full detachment of Royal Guard to apprehend or execute Lydia for her treason. But even the best soldiers in Aravia were not enough to stop her now.\nThey arrived just in time to see Lydia complete her latest, most convoluted ritual that drained the lifeblood of numerous lesser mages and channeled it all into a singular vessel - Lydia’s own body. It twisted and changed before the eyes of the baffled soldiers; wings of raw bone and swirling blood sprang from Lydia’s back, razor-sharp talons formed on the tips of her fingers, and her agonized wail shattered even the stoutest of hearts. Her power now increased manifold, Lydia slaughtered her way out from her besieged estate to join the civil war that already raged on the streets of the Elvish capital.\nTheir coup was doomed to fail. Even the combined malice of the Dark Elves had proven insufficient to topple the realm of Aravia. Along with countless other apostates, Lydia was forced to flee the wrath of her vengeful kin, cursed to wander the lands of Teleria as an exile and hunted like a beast. And yet the legend of the Deathsiren endured. None of the would-be hunters succeeded in laying Lydia low, and she still stalks the crypts and ancient ruins in search of anything that would help her further her magical power and conquer death once and for all.",
        "image": "",
        "link": "https://fb.watch/4Q9XPPMjjQ/"
    },
    {
        "name": "Shadowkin",
        "lore": "Far to the east of Teleria, beyond the cursed wastelands of the Brimstone Path, there lay the kingdom of Yakai, known to the other races as the Dawnlands. A land of plenty, where humans dedicated themselves to art and philosophy, free of strife that so often beleaguered their kin throughout history. They strove to build a society of honor and discipline, where the rulers were just, the warriors loyal and brave, the common man honest and hard-working. Some would say they succeeded, for a time. But no corner of the world is safe from the baleful eye of Siroth.\nWhen mortal alliances crumbled and the Arbiter’s power waned, the servants of evil overwhelmed the kingdom’s defenses and left it at the mercy of Demonspawn legions. For centuries, the vile creatures ruled with an iron fist. Dissent was crushed without mercy, children trained as cold-blooded killers, abominations of half-demon blood were spawned into the world and brought into the ranks of Siroth’s minions.\nDubbed the Shadowkin after that conquest, the people of Yakai were forced to do Siroth’s bidding. Many were the dark deeds they had performed in his name before, at last, they could stand for atrocity no longer. The Shadowkin rose against their demonic masters, launching a rebellion that lasted well over a century and left the fertile Dawnlands devastated. Yet they stood victorious, free of the Dark One’s yoke.\nTo the people of Teleria, the Shadowkin had faded into myth; many believed they were all killed or turned to Demonspawn over the years, and not one soul expected these once-proud warriors to return. Curiously, it was another resurgent kingdom that welcomed them. The Dwarves had scouts and envoys braving the furthest reaches of Teleria to inform the Mountain King of what had become to the World Above during their self-imposed exile - they were the first to make contact with the Shadowkin. Representatives of both factions met at the foot of the Nyres mountain and signed a pact that would become known as the Nyresan Union.\nAs for the other great nations of Teleria, they regarded the Shadowkin with distrust or outright hostility. Some remembered the damage their forebears wreaked, others saw the half-demon warriors as an abomination - an affront to Lumaya. And who could fault them? Many Shadowkin still carry the curse of Siroth in their blood, and terrible was the suffering they had caused in the past. Indeed, there is much to atone for, and only time will tell if their honor can truly be regained in a new war against the forces of evil.\n",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/160764153_3802955033153307_3895075916035560493_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=730e14&_nc_ohc=7dEBy4dDZ3oAX-Bug9n&_nc_ht=scontent-dfw5-2.xx&oh=424f1048ce357f13adeb2261afe9e600&oe=609BE1C1",
        "link": ""
    },
    {
        "name": "Pyxniel",
        "lore": "Far to the east of Teleria, beyond the cursed wastelands of the Brimstone Path, there lay the kingdom of Yakai, known to the other races as the Dawnlands. A land of plenty, where humans dedicated themselves to art and philosophy, free of strife that so often beleaguered their kin throughout history. They strove to build a society of honor and discipline, where the rulers were just, the warriors loyal and brave, the common man honest and hard-working. Some would say they succeeded, for a time. But no corner of the world is safe from the baleful eye of Siroth.\nWhen mortal alliances crumbled and the Arbiter’s power waned, the servants of evil overwhelmed the kingdom’s defenses and left it at the mercy of Demonspawn legions. For centuries, the vile creatures ruled with an iron fist. Dissent was crushed without mercy, children trained as cold-blooded killers, abominations of half-demon blood were spawned into the world and brought into the ranks of Siroth’s minions.\nDubbed the Shadowkin after that conquest, the people of Yakai were forced to do Siroth’s bidding. Many were the dark deeds they had performed in his name before, at last, they could stand for atrocity no longer. The Shadowkin rose against their demonic masters, launching a rebellion that lasted well over a century and left the fertile Dawnlands devastated. Yet they stood victorious, free of the Dark One’s yoke.\nTo the people of Teleria, the Shadowkin had faded into myth; many believed they were all killed or turned to Demonspawn over the years, and not one soul expected these once-proud warriors to return. Curiously, it was another resurgent kingdom that welcomed them. The Dwarves had scouts and envoys braving the furthest reaches of Teleria to inform the Mountain King of what had become to the World Above during their self-imposed exile - they were the first to make contact with the Shadowkin. Representatives of both factions met at the foot of the Nyres mountain and signed a pact that would become known as the Nyresan Union.\nAs for the other great nations of Teleria, they regarded the Shadowkin with distrust or outright hostility. Some remembered the damage their forebears wreaked, others saw the half-demon warriors as an abomination - an affront to Lumaya. And who could fault them? Many Shadowkin still carry the curse of Siroth in their blood, and terrible was the suffering they had caused in the past. Indeed, there is much to atone for, and only time will tell if their honor can truly be regained in a new war against the forces of evil.\n",
        "image": "",
        "link": "https://fb.watch/4Qa8zEi4r8/"
    },
    {
        "name": "Rian the Conjurer",
        "lore": "Many a mage relies on the forces of nature, channeling them through arcane means to whatever goal they have in mind. They call down rain and lightning, set the swords of their allies ablaze, or even destroy their foes with acidic hail - all impressive displays of wizardry to the laymen. And all more fitting for tricksters putting on a show with light and mirrors or children playing with forces they cannot fully comprehend, if Rian the Conjurer is to be believed. It is an arrogant claim, yet one she can back up with immense power and knowledge.\nOnce a sorceress in service to a cruel Dark Elf warlord, Rian was ever an ambitious woman. She was not content to serve another, to scrape and bow before a would-be king whose reign was sure to end with a dagger driven through his black heart. No, this arrangement was never meant to last, and Rian used her position to acquire whatever wealth and knowledge she could by manipulating her hapless thug of a patron. When the time came, she instigated the warlord’s assassination and fled in the chaos of infighting that followed.\nHer freedom secure, Rian traveled across the realms of Teleria in search of ancient relics and powerful mages from whom she could learn… or steal. She sought out exiled Aravian scholars, shamans of the Orc and Barbarian tribes, eager to pilfer their secrets. She studied every obscure technique they had to offer until she mastered the element of fire and could conjure a blazing inferno with a mere snap of her fingers.\nThen, Rian set out to the city of Narbuk and struck a pact with the Necromancer coven that long existed within its ancient walls. From these villains, she learned the dark secrets of soulblight magic and the proper rituals that would allow her to return the dead to life. But Rian would not be herself if she did not perfect these dark techniques, ensuring that her spells far exceeded the crude reanimation of dead flesh.\nHowever, that too was not enough. Rian sought to ascend to greater heights of mastery and conceived a daring plan that saw her enter the royal court of Kaerok. For years she crafted a false identity to conceal her evil deeds. When the time came, she presented herself as a lowborn apprentice to a late High Elven mage and sought the good graces of the King’s own Archmage, Hellmut. It was not an easy task, for Hellmut was a shrewd man, wisened by experience and constant intrigue.\nIt took all of Rian’s cunning to secure her access to the Archmage’s tower. There, she found ancient tomes that spoke of creating artificial life - servants born of stone and fire and metal to do the mage’s bidding - and a scepter of power that enhanced the flow of one’s innate magical talent. Alas, Hellmut caught her in the act, and a terrible battle ensued between the two. The stone walls of the tower cracked and wood splintered, priceless books burned, and the sky itself blackened in a storm of arcane energy when the two of them clashed.\nHellmut had proven to be stronger in the end, but Rian’s would not die easily. When all seemed decided, she used the knowledge of Hellmut’s own tomes to call forth a fiery golem that shielded her from the Archmage’s wrath. Once more she escaped while Hellmut battled her creation, disappearing into the wilderness and evading all pursuits the King’s Bannerlords sent after her.\nNo one knows where Rian the Conjurer dwells now, but there are sightings of an elf woman who fits her description - albeit clad in garish robes. Those who were fortunate to survive the encounter also spoke of a dagger of obsidian glass she carried, wreathed in dark magic, its very presence awakening primal terror in the hearts of the unprepared. Two creatures of living stone are said to accompany her at times: one a fiery beast of raw rage, the other a horrible construct of tortured souls imprisoned in an artificial body. What these creatures are and what sacrifices Rian had to make to create them, none may tell. But one thing is certain - she is more powerful now than she ever was, and Summoners who seek her services should beware. Who knows what treachery she is capable of.\n",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/135479413_3611319968983482_3444069812661425583_n.jpg?_nc_cat=106&ccb=1-3&_nc_sid=730e14&_nc_ohc=lkvKdqzTzFgAX9u7-49&_nc_ht=scontent-dfw5-2.xx&oh=ef9c68be7f6a21fb3341798469cae143&oe=60994C9A",
        "link": ""
    },
    {
        "name": "Yoshi the Drunkard",
        "lore": "Yoshi had always found soldiering to be a dull business. Not the fighting nor the cracking of skulls - he did always love those - but the discipline, the subordination to some high-and-mighty noble, the reveille at ungodly hours were intolerable! No, Yoshi was never meant to be a soldier, yet a soldier he was, fighting for his homeland against the dreaded Demonspawn.\nHe was young back then and, despite all his grumbling, believed in the rebellion with all his heart. Though hardships were many, Yoshi remained brave and true. And the Ancestors smiled on him. He lived to see the war through, celebrate the liberation of the Dawnlands, and enjoy the spoils of victory. For a few years, Yoshi traveled the realm, feasted until his pockets were empty, and started brawls for the sheer thrill of it. \nEver the vagrant, Yoshi did not settle down even after his silver ran out. It was not until he found himself drunk, sleeping on a monastery porch on a cold spring night, that his fate took a turn for the better. Shadowkin monks were warriors all, dedicated to the study of martial arts in their many forms. So when an aggressive lout had disrupted their morning rites with demands of water and food to fill his belly, their response was as firm as one would expect. \nThe fight was brief. It left Yoshi both impressed and humbled, which was a rare enough occurrence. Yet the monks too appreciated the raw talent they saw in that scuffle enough to offer the interloper a chance to join them. It was a chance Yoshi took, for few people could brag about giving him such a good thrashing.\nIt was not all easy, of course. He was forced to learn discipline once again, center his spirit, and rein his baser instincts in - a prospect the jolly drunkard did not enjoy one bit. Fortunately, the skills he studied in the monastery were a fair trade-off for these inconveniences, and the monks fed him well! The years Yoshi spent there he still remembers with great fondness even today. \nBut wanderlust is a foe not so easily defeated, and Yoshi could not stay locked up in a cloister forever. He learned what he could, mastered his body, and finally bid farewell to his friends before venturing out into the world beyond the fortress walls. That same wanderlust drove Yoshi to join the first Shadowkin who left their kingdom’s borders and traveled westwards to the other lands of Teleria, and many were their adventures along the way. From the endless dunes of Krokhan, where Yoshi faced mighty Barbarian heroes in single combat, to the grand Elven cities, he soon became the stuff of legend among the mercenaries and tavern-goers. \nYoshi remains an enigma to the outsiders, and their opinions tend to vary between awe and disgust. A man of strange origins, boisterous and joyful - yet quick to let his cudgel do the talking - is certainly not the easiest guest for the City Watch to handle. Though the strange spirits Yoshi calls upon cause grave concern among the traditionalist High Elves and Knights of the Sacred Order, one thing is certain - Yoshi the Drunkard would rather renounce saké than raise his weapon in service of evil. That conviction, coupled with his uncanny skills, makes him a worthy ally to anyone seeking to keep Teleria safe from Siroth.\n",
        "image": "",
        "link": "https://fb.watch/4QaqAJv_1n/"
    },
    {
        "name": "Archmage Hellmut",
        "lore": "Not a single soul in Teleria could deny that magic offers a path to power. In days long gone, it was commonplace for shamans and sorcerers to command nations, and to this day, it is not unheard of for the rulers of Aravia to practice arcane arts. Even the monarchs not blessed with natural magic talent often find themselves in need of a wizard - thus many magicians flock to the courts of the rich and the powerful. For most commoners, amusing some baron’s guests with tricks or scrying their future is the height of ambition. But becoming a Royal Archmage for the King of Kaerok, the Knight of Knights? That requires intelligence and the strength few possess.\nBorn to a simple scribe, Hellmut was surrounded by books, scrolls, and the scent of ink from the very first days of his life. He learned to write and read earlier than most of his peers and often spent his days stuck in a book from dawn to dusk. Had it continued like that, Hellmut would have become an excellent scribe, perhaps even attain a cushy position as a magistrate for some Duke. But fate had other plans.\nIn his seventh year, Hellmut created something of an uproar when he set the town library on fire after attempting to replicate a faded cantrip formula he found. That in itself was quite an achievement, and the boy was fortunate to have his talents noticed by one of the local Marquise’s officials. Soon enough, a messenger arrived with the Banner Lord’s decree - Hellmut was to pack whatever possessions he had and depart for the Mage Seminary of Kaerok. There, he would spend the rest of his formative years and learn his new craft. It was the last time he had seen his home.\nIt took long twenty years before Hellmut emerged from the cloistered towers of the Seminary, a mage in his own right. He was ambitious, intelligent, and garnered the attention of many prominent wizards of his time. But it was the Royal Court that called to Hellmut, and thus he set out to the Castle of Kaerok where the King’s majordomo ensured his services were put to good use.\nIn that role, Hellmut accompanied armies and headed expeditions into the most dangerous corners of Teleria. He defeated Zavir the Crimson Eye - a powerful Orc warlock whose tribe raided the eastern borders of Kaerok - in a duel of arcane prowess and claimed countless artifacts for the King. The realm’s most influential nobles sought his counsel, so it was no surprise Hellmut was named the Royal Archmage after his predecessor died in a freak accident involving a barrel of dragon dust and an experimental witchfire lantern.\nHaving inherited Bibliotheque Spire, one of the greatest repositories of knowledge known to man, Hellmut plunged headlong into research and disappeared from the court for almost a year. Tractates on extremely complex chrono-magic and the art of manipulating various elements had given the newly-anointed Archmage insight into many mysteries which his peers could only dream of. Alas, even wizards of great intelligence are not immune to deceit.\nAn elven sorceress by the name of Rian managed to attract Hellmut’s eyes. She was shrewd, charismatic, talented, and had a knack for carrying out the most difficult missions with discretion. Hellmut had taken the young woman under his wing and was repaid with treachery.\nRian, as it turned out, was a dark mage who only sought to use him to gain access to the Bibliotheque Spire. She stole valuable artifacts and escaped through trickery when Hellmut almost had her cornered. Yet the Royal Archmage would not rest until his honor was satisfied. He personally led hunting parties that searched far and wide for his treacherous apprentice, but fortune was not on his side this time.\nPerhaps that is how Archmage Hellmut came into contact with the Arbiter. Had she offered him a chance to see justice done in exchange for his eternal services? Perhaps you will be able to ask yourself, should you gain the venerable wizard’s loyalty.\n",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/136360333_3619143691534443_5884295776898973231_n.jpg?_nc_cat=106&ccb=1-3&_nc_sid=730e14&_nc_ohc=zqnOZZOi6i0AX-biHdC&_nc_ht=scontent-dfw5-2.xx&oh=afb01b7f69fdf4d3df04de59df781c09&oe=609B45B7",
        "link": ""
    },
    {
        "name": "Yakarl the Scourge",
        "lore": "Clad in ornate armor of black steel, gold, and hoarfrost, Yakarl strides through the hurricane of battle like an ice giant of the Old Norr myths. He is a living legend himself, a Champion from the days when Norr raiders sailed across the ocean and struck terror into the hearts of all those unfortunate enough to attract their rapacious gaze. The runes tattooed upon his body and etched into the beard of his axe still glow with the vicious glory of those days, yet now he saerves a higher power.\nEven as a young warrior, Yakarl was renowned for his strength, courage, and luck. He made a name for himself in daring forays across the coast of Aravia, razing and pillaging small settlements only to escape with rich plunder before the Elven forces rallied to retaliate. He earned the respect of his fellow warriors and soon enough led a small band of his own in even more brazen ventures that took him from the stormy Valdemar Strait to the rocky shores of Kaerok.\nThe tales of Yakarl’s deeds spread, and his wealth grew over the years - as did his authority among the Norr. Yet that was not enough to sate his lust for fame. He desired nothing short of becoming a chieftain whose name would be hailed above all others. And so, when an old skald came traveling through his land, singing songs of an ancient weapon forged by the hand of Brimir himself, Yakarl took heed. He received the stranger with honor, calling for a feast in a show of ostentatious hospitality. And at the height of the festivities, when all his guests were drunk on fine mead and ale, Yakarl swore to travel northwards and recover the legendary Axe of Allwinter in a quest that would be celebrated for all time.\nEight ships he outfitted to set sail, his bravest warriors by his side. Some counseled Yakarl to abandon this wild dream of his, or at least wait until next year - winter was coming, and the treacherous waters of the northern sea were soon to become nigh-impassable. But the chieftain remained implacable. He would not abandon his oath even in the face of grave danger, for that would bring dishonor beyond what he could bear. And so, the ships left the craggy haven of Yakarl’s home within a fortnight.\nThrough storm and blizzard they sailed, fighting for their lives both against nature and the vicious monsters that dwelt in the North. One by one, Yakarl’s ships were lost, sunk or overrun, and yet he stayed his course. Even when the shimmering lights of the aurora shone high overhead and Yakarl’s vessel was the only one to survive, he refused to turn back. But with his crew diminished, he too began to lose hope. Too weakened to fight his way back through the frozen waters, his choice was simple - to succeed or to die trying.\nBut even in that darkest hour, Yakarl’s fortune did not fail him.\nOn the night of Yuletide, Yakarl stood alone on the prow of his ship, pondering over the cruelties of fate and the depth of his own hubris. The bitter cold held him immobile surer than any chain forged by mortal hands, and death seemed all but certain. Then, Yakarl heard a chime of bells that seemed to permeate his very spirit. It was a strange sound, one that made him think that he had gone mad at last. In truth, this chime heralded the arrival of their savior.\nTo his astonishment, Yakarl saw the old skald who first told him the legend of the Axe, but now that skald rode a sleigh that soared above water, no longer clad in rags but in a gleaming armor and a vibrant cloak of crimson and white. No other than Sir Nicholas himself came to see the brave seafarers who had traveled this far and battled through countless dangers.\nHe spoke to Yakarl in a voice booming like thunder and held aloft the Axe of Allwinter - the very prize which led the Norr chieftain into the jaws of death. It would be his, Nicholas proclaimed, for few possessed the will and determination to survive in these inhospitable lands. There was, however, a catch. Yakarl had to swear his life into the service of Goddess Lumaya and fight as her Champion against the forces of Darkness that threatened Teleria. Thus, the ancient warrior said, he would earn glory and fame beyond his wildest dreams.\nIn a way, this was a dream come true. To wield a weapon of ancient might, to fight eternally against worthy foes, and be hailed a hero by mortals across the realms of mortals? Yakarl accepted without hesitation, and in a flash of blinding light Sir Nicholas bound his soul to one of Lumaya-given Shards.\nThus imbued with the Goddess’ power and with his prize in hand, Yakarl led the survivors home. There, he divided his riches among them and chose a worthy successor to rule in his stead. With the duty to his people fulfilled, Yakarl left once more and sailed to the North where his new, eternal life awaited.\n",
        "image": "",
        "link": "https://fb.watch/4Qb02-2fLp/"
    },
    {
        "name": "Minaya",
        "lore": "Once upon a time, in the fair land of Kaerok, there lived a young Knight. She was beautiful and kind-hearted, spreading the compassion of Lumaya through words and through deeds. Not only did she fight to protect the weak, but she also learned how to soothe the wounded, for her heart would accept nothing less.\nAlas, her rival nobles looked upon her with disdain and jealousy. Before too long, assassins stalked her shadow as she walked the woods near her home. The ambush began with a poisoned bolt, but it missed her by a hair - a flash of Lumaya’s blessed light had blinded the would-be killer. Glancing around, the Knight saw herself surrounded and outmatched. She had no choice but to flee.\nShe rode hard, dodging trees and arrows both. Minutes turned to hours, and evening turned to night by the time she lost her pursuers. By then the Knight was wounded and fatigued, she was lost in the deep forest, and her horse had been driven to exhaustion. There was little hope of salvation, but as the moon rose and lit her path, she found old weathered cobblestones beneath her feet. The road was not inviting: overgrown, abandoned, and nearly lost to the brush. But assassins yet lurked, and wolves could be heard in the distance. She had no choice.\nThe abandoned road led her to a magnificent castle rising up from the forest. Though the stone was ancient, it was clear that someone - or something - maintained this place. The grounds were kept. The doors sat imposing in their frames. And… an eerie light could be seen from the windows of the tallest tower.\nThis was a Fey place. The Knight knew to fear such things. And yet, she led her horse into the vast gardens that lay around the castle. Flowers of unearthly beauty bloomed on all sides, bringing with them the promise of dark and ancient magic to come.\nThe Knight did not turn back. Something held her. Her heart beat faster and faster, bringing a blush to her cheeks as she approached the great doors of the castle. She was meant to be here, she realized. Something in this place was broken that she was meant to heal.\nShe struck the knocker on the door, and, far above, a lonely silhouette disappeared from its post at the window.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/85200738_2723919867723501_7825020828050784256_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=730e14&_nc_ohc=-1NCXmIA4ksAX9PmSJb&_nc_ht=scontent-dfw5-2.xx&oh=e188462fb41d550c998144d77ee9a855&oe=609B9E22",
        "link": ""
    },
    {
        "name": "Dark ELhain",
        "lore": "Elhain had never been an easy ally to bond with. A noble of Aravia, daughter of a proud Elven bloodline, she inherited much of the arrogance and condescending sense of superiority the High Elves are infamous for. She was proud and determined, perfecting her skill with the bow from an early age and seeking to test herself against the most daunting challenges. Yet, for all that self-righteousness, Elhain did genuinely believe in the precepts of Lumaya and sought to eradicate evil wherever it could be found.\nRecruited into the Arbiter’s service first, she found herself banded together with a most unlikely company - Athel, a Paladin of the Sacred Order; an outcast dark mage Kael, who sought refuge from powerful rivals; and an Orc warrior Galek, whose savagery and brutishness she always found disdainful. But the oath she had sworn kept Elhain bound to her duty, and onwards she forged with these colourful allies at her side.\nWhen Sir Nicholas arrived from the North bearing troubling news and seeking aid, it was Elhain who volunteered to assist him - the decision that Sir Nicholas himself had foreseen in his vision. He recruited the young Elven warrior into his own band of Champions that was bound for the Winterlands. Along the way, Elhain had proven worthy of the esteemed company she found herself in - with Princess Lyssandra of Aravia and the Mountain King of the Dwarves at her side it was a difficult challenge indeed! - through deed and word. She used her talents and her keen eye to scout ahead of the Company, rooting out many a threat before it could endanger her allies and felled many foes with breathtakingly accurate shots.\nBut bandits and bloodthirsty Orc raiders were irrelevant, Elhain’s true test came when she and her allies reached the Winterlands. There, an army of Undead led by vengeful Wurlim Frostking ambushed the Champions and nearly had them trapped on a narrow mountain path. Were it not for Elhain’s bravery and quick thinking, their quest would have ended there. But she sacrificed herself, causing an avalanche that swept away the bulk of the skeletal horde from the path and smashed them against the mountainsides. Alas, Elhain could not save herself and too perished beneath the snow.\nFurious over the loss of his minions, Wurlim sent the surviving Undead to uncover Elhain’s body and enacted a vile and cruel ritual that prevented her soul from returning to the Shard it had been bound to by the Arbiter. Trapped and twisted to the Frostking’s will, Elhain was brought into the world anew. Her heart was encased in ice, her loyalty and her honour replaced with cold, ruthless cunning and unshakable obedience to her new Master.\nTogether with Wurlim, the creature that was once Elhain marched onwards to the Font of Lumaya at the heart of the Winterlands, determined to stop her former companions from thwarting the Dark One’s schemes. That, perhaps, would prove to be her salvation, for the water of the Font was known to restore life and cleanse the Curse of Undeath. But before she could be restored to her former self, Sir Nicholas and the others would have to survive their friend’s deadly skill in battle as well as the fury of the Frostking...",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/89048316_2793660734082747_6870942269000646656_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=730e14&_nc_ohc=FhwBZkeCLfEAX_nWEZ-&_nc_ht=scontent-dfw5-1.xx&oh=1f6d30c527470cc431d2878fc5b7058c&oe=6099F39D",
        "link": ""
    },
    {
        "name": "Vergumkaar",
        "lore": "Though many see Vergumkaar as a mere beast of burden - exotic as he is - it would be folly to underestimate the intelligence concealed beneath that magnificent bulk. Indeed, he may not be able to speak, but, like the mighty dragons he is related to, Vergumkaar is fully sentient and possesses wisdom nurtured over many centuries - one only has to open their eyes to see it.\nHis origins lie to the north-east, where the remnants of a once-great civilization dot the jungle beyond Godfrey’s Crossing. Vergumkaar was born there, the last scion of an ancient Dragonkin warrior caste. Once flesh-crafted by Lizardmen priests, these noble defenders regressed to a half-bestial state over the millennia of neglect and savagery that the fall of their people’s empire had wrought.\nVergumkaar was not alone when he hatched into the unforgiving world of Teleria. A tribe of his distant kindred, primitive and clinging to traditions they no longer understood, revered him as a demigod; they catered to his every whim and ensured the drakeling matured into a mighty and stalwart creature. Hundreds of years passed in a bountiful bliss, but that could not last forever.\nSlowly, the tribe died out, and Vergumkaar alone remained amid the ruins. There he dwelt for years uncountable, hunting, defending the crumbling temple walls from intruders and treasure hunters. The flow of time had begun to take its toll, and Vergumkaar soon found his mind slipping, his sentience dimming and giving way to blind instincts. It would take a truly momentous encounter to pull the ancient drake out of this quagmire.\nOne day, a brash Barbarian warrior by the name of Ursuga ventured into the Lizardmen-infested jungle in search of riches and glory. She had conquered many challenges during her adventures and was not deterred when an ancient drake barred her way. It was a worthy challenge indeed! And for Vergumkaar, this was just another intruder defiling his lands. And so battle they did.\nThree dawns and three sunsets passed, bearing witness to the heroic clash between the Barbarian and the Dragonkin, until both of them collapsed in exhaustion. During that time, Ursuga realized it was no mere beast she faced, and had gained a new respect for her adversary - as did Vergumkaar. Seeing the intelligence in the drake’s eyes, Ursuga chose to communicate rather than attack once more and, to her surprise, the creature proved to be more than capable of understanding her. With nothing truly holding him anymore, Vergumkaar had chosen to follow the strange human - thus strengthening the bond they had forged by testing their strength against one another.\nMany roads they traveled together, and many dangers they overcame. Tales of Ursuga’s glory grew, and Vergumkaar remained at her side, his stoic resolve balancing the Barbarian’s boisterous and impatient temper. Neither the haughty High Elf nobles of Aravia nor the dark-hearted apostates roaming the abandoned crypts of Stormwind Wastelands could stop the duo adventuring through their domains. The riches they won, the foes they vanquished lent to Ursuga’s and Vergumkaar’s illustrious reputation.\nTo this day, the locals in Aravian taverns love recounting the bizarre adventures of a Barbarian from the East and her faithful dragon steed, whose amber eyes burn with fierce intelligence and whose scaled bulk carries the bounty of countless successful ventures. Should you ever meet this mountain of a woman and her saurian friend, you would do well to show proper respect - they are much better to have as allies than as enemies",
        "image": "",
        "link": "https://fb.watch/4QbEYlExd9/"
    },
    {
        "name": [
            "Siphi the Lost Bride",
            "Rotos the Lost Groom"
        ],
        "lore": "There are many sad stories in Teleria. Most are forgotten. Some… some will not allow us to forget them.\nGo to a place on the southern coast of Arnoc, far off the beaten roads, along the sea cliffs where waves crash and seagulls cry. Travel the southernmost road out of Kaerok, but step off the path at a birch tree a few miles from Felwin’s Gate. Walk the coast for an hour or so. If you’re looking, you will find a crumbling church atop the bluffs.\nIt’s a Lumayan church, but you’d never know by looking at it. Ignore the rotted arch and broken tables within - the wedding feast went to dust long ago. Instead, step to your left, on the path to the graveyard. Cut away bushes and brambles until you find two graves, set side by side. The words on the headstones are long gone, but the story lingers. It was a story of young love - of promise, and of joy. But you’ve found it on a headstone, so perhaps you can imagine how it ended.\nTreachery leaves a mark on the world that can last much longer than the betrayed. Not this time, though. This time… well. If you were to dig up those graves, you would find them empty. Before sundown, anyway. I advise you not to linger.\nThere are many sad stories in Teleria. Some will not allow themselves to be forgotten.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/84286151_2723921804389974_7176331889903403008_n.jpg?_nc_cat=103&ccb=1-3&_nc_sid=730e14&_nc_ohc=hAFXyeOLWrMAX9g_BrE&_nc_ht=scontent-dfw5-1.xx&oh=c2069becc9e597b3ddc8f94755404839&oe=609A7013",
        "link": ""
    },
    {
        "name": [
            "Siphi the Lost Bride",
            "Rotos the Lost Groom"
        ],
        "lore": "There is another tale of love well known in Kaerok and Arnoc, but one much darker than Minaya’s and Khoronar’s adventures. It starts with a bold young nobleman, whose family had lost everything but their title; their lands, their estates, their wealth - all had been seized to repay debts accumulated over generations of careless debauchery. This left Rotos with little to his name except for his pride and his skill with the rapier. Though that barely stopped the young man from spending his youth duelling, drinking, and racking up new debts. It was only when the danger of assassins sent by the usurers became real that he finally realized it was time to disappear, at least for a time.\nAlthough his talents were limited and so were the fields where Rotos could employ them in full, he had chosen a career many would not have considered - that of a pirate. With what little silver was left in his purse and his faithful rapier at his side, Rotos sought out the crew of a pirate ship and made his bid to join.\nHe spent the next decade sailing the seas and living the life of high adventure, where skill, audacious bravery, and a dash of good fortune were the only things one could rely on. Though he led many brazen raids upon attaining his own captainship and grew rich on plunder, Rotos remained a gentleman of good repute first and foremost. He was never bloodthirsty and never killed without need, nor allowed his crew any excesses. On occasion, he pursued and fought less scrupulous corsairs who ‘gave the profession a bad name’ as Rotos himself claimed.\nIt was one such encounter that allowed the bold Captain to claim his most prized treasure. But it was neither silver nor gems nor even an enchanted weapon of days long past that captivated Rotos’ heart. It was a woman by the name of Siphi, hailing from faraway southern islands, whom Rotos freed from captivity. She was beautiful and fierce, and while she was not trained as a warrior, Siphi seized the opportunity during the boarding battle and struck down her captors right in front of dumbfounded Rotos. If there was ever love at first sight, he told his crew later, it would have to be the sight of an angry Southerner woman knocking a brute twice her size out with a candleholder.\nWhile some scoundrels may have taken advantage of the situation, Rotos was determined to court and woo his beautiful rescuee the old-fashioned way. Siphi met his advances with cold derision at first, then with amusement, but Rotos’ charms were as true as was his determination. After weeks of back-and-forth, she finally relented and showed interest, and this was but a spark that lit the flames of passion. Over the next several months Siphi and Rotos spent nearly every waking hour together and grew to truly appreciate one another.\nShe became his confidant, his voice of reason, and Rotos remained the brazen risk-taker with a contagious lust for adventure and dramatic flair that would put High Elves to shame. As their love blossomed, Rotos finally realized that the time to return home was upon him. With the riches he gained in the past decade, he managed to pay off all of his debts, and still own enough to ensure he and Siphi would live in luxury - provided the silver was spent wisely to set his ancestral household up once more. \nUnfortunately, Mayhew Pouillac - the wealthiest money-lender in Arnoc at the time - regarded the damage his reputation sustained when Rotos fled to be far greater than any payment could make up for. He pretended otherwise, however, and accepted Rotos and his then-bride like guests of honour. For a hefty interest on top of the original debt and penalties, Pouillac ‘forgave’ Rotos and even offered assistance in rebuilding his family estate. \nBut on the day of Rotos’ and Siphi’s wedding, the vengeful usurer finally enacted his cruel plan. Hired thugs barged into the church where the ceremony was taking place. They carried bared weapons which ignored all tradition and Lumayan law and slaughtered unarmed guests like cattle. Although Rotos’ frenzied last stand cost more than a dozen mercenaries their lives, he had no chance against so many on his own. Crucified against the wall with spears, he could only watch in desperation as brutish hirelings murdered Siphi moments before his heart stopped beating. The last thing he heard was Siphi cursing the treacherous wretches in her native tongue and promising vengeance from beyond the grave.\nWith their bloody work done, Pouillac’s mercenaries departed, leaving the bodies of the slain where they had fallen. It was fortunate that the local townsfolk discovered the slaughter and ensured proper burial rites were upheld, but of the murderers, there was no sign. Days passed, the Sheriff charged with overseeing that province found no leads and made little effort to seek justice on behalf of a man who was a known pirate, and, meanwhile, ominous rumours spread through the land. People said that the flowers left on the graves of the newlyweds all withered within a night. All save for two roses, which turned an unnatural and eerie blue - unlike any of the flowers that grew in those parts. Others spoke of loud weeping and wailing, of the sound of nails raking the wood of the coffins coming from below ground. Of strange, mist-like figures appearing in the church. It did not take the locals long to declare the place cursed and abandon it altogether. \nBut the echoes of this slaughter reached as far as Arnoc itself, and vengeance promised by Siphi came to fruition before her murderers even had a chance to celebrate their success. One by one, the mercenaries involved in the attack died under mysterious circumstances. They always disappeared in the dead of night, only to be found by morning with their faces pale and twisted with fear, their bodies bled dry. No matter what they did, no matter what gods they prayed to, within a fortnight they died to a man. \nNews of the murders reached Pouillac and sent him scrambling. Had Rotos somehow survived the attack? Did his mercenaries lie? There were no answers to these questions, and the terrified usurer barricaded himself in his estate, doubled the guard, and waited for the storm to pass. None of that availed him… \nOne night, blood-chilling screams shattered the silence over Pouillac’s estate. So terrifying they were, that the citizens who lived nearby barred their doors and windows, unwilling to risk whatever monsters stalked their streets. It was only in the morning they dared to enter the usurer’s grand manor. What they found inside was shocking - bodies heaped across the floors, all with the same fearful look frozen on their faces. Not a single soul survived, no guard, no servant, they had all perished during the night. And as for Pouillac himself, he was found in his chambers, curled up and gripping himself so tightly it took the coroners considerable effort to move his hands from his face and reveal the look of primal terror that must have stopped the usurer’s heart in his final moments.\nNo trace of the murderers was ever found, but Old Arnault, a crippled half-mad drunk of some renown in the city, swore on Lumaya’s name that he saw two ghostly figures in the estate’s courtyard that night. One a man in the trappings of a nobleman, one - a woman dressed in strange finery of foreign make. Who or even what they were, he could not say. Only that the strangers left the estate soon after screaming stopped, then faded from sight, never to be seen in Arnoc again.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/86343587_2738106032971551_4759824109095878656_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=730e14&_nc_ohc=mX5PUAeCOfIAX_pTU7h&_nc_oc=AQltweTTG-K6d9P8DCvalSlj2hOYv41KQNRbIvcm6q1pcOBiif9t6hHIsZx9mtZj_V0&_nc_ht=scontent-dfw5-1.xx&oh=969dddfc8069343b6b234e14f5ec9c4c&oe=609A0FEF",
        "link": ""
    },
    {
        "name": "Drokgul the Gaunt",
        "lore": "Long before the first humans set foot to the vast tundras of Telerian north, it was an untamed land of spirits and mysteries. Trollfolk dwelled amid the craggy mountains and grassy hills, their rule unchallenged for many centuries. For most of them, it was a simple existence unburdened by the calamities of change or naive dreams of progress. But even among such simple creatures, a spark of genius can be found.\nDrokgul had seen much strife in his youth, for his temperamental nature led him to fight his kindred over hunting grounds, spoils, even minor insults. No clan, no matter how small or desperate, would accept him, and his rivals soon banded together to defend themselves. So it came to pass that Drokgul was driven from his home and forced into exile.\nFor many winters he roved alone, resentful and full of anger. Yet in this solitude, Drokgul had time enough to brood over his fate as he scraped a living in the northmost wastelands where the chilly breath of winter was his constant companion. Eventually, he came to a startling realization. All his grief and hardship were the result of his own failings, no one else’s. Struck by this truth, Drokgul vowed to find enlightenment and break free from the vicious cycle of violence he had created. So began his long path to wisdom.\nMany roads did Drokgul travel. He went as far as the arctic wastes of Teleria, where he learned as much as one could of Jotuns and their rune scripture. Then to the south, where he first encountered the primitive humans and studied their customs. It was far past a century before Drokgul returned home, a wisened and weary elder.\nHe made his dwelling on a tall rocky hill, where he practiced what magic he learned from the northern giants and sought unity with nature. His very skin turned to rock in time, and his life lasted far beyond even that of a troll. Empowered by arcane energies, Drokgul became akin to a spirit of nature himself, tending to his domain and bringing his wrath on those who would threaten it.\nThen, the humans came. These were simple folk, blood-bound clans that fled northwards from some unnamed terror. To them, the ancient and powerful creature was like a god - a misunderstanding that amused Drokgul greatly. Yet he struck a pact with the barbarians, letting them settle the valley ‘neath his home in exchange for sacrifices of game and cattle. Over generations, Drokgul remained a mystical guardian whose knowledge of runes and magic inspired many young shamans and led the clans living under his protection to prosperity.\nBut alas, evil does not rest. When the tainted servants of Siroth swept across the land, not even Drokgul’s strength was enough to defend his human allies. Many were slaughtered, others were forced to flee. And the noble troll found himself wounded and enraged at such iniquity. It was then he swore another oath - to find vengeance for those he could not protect.\nOne final time did Drokgul set out from ravaged homeland, his gaze turned to the south. Where he walks now, few can say. But any enemy of Siroth would be blessed to recruit this venerable Champion’s strength to their cause.",
        "image": "",
        "link": "https://fb.watch/4Qb_hQ3hRk/"
    },
    {
        "name": "Bazaar",
        "lore": "Wealthy beyond the imagining of the common folk, the Merchant Princes of Velyzar spend extravagant sums in gold and silver to promote their gladiator games. Nothing short of the very best fighters would satisfy them, and thus the Princes hoard some of the rarest and most powerful arcane items that can be found in Teleria. These serve as reward to successful warriors, whose bravery and skill attract enormous crowds to the city.\nThe enchanted jewelry sold in the bazaars of the Arena has peculiar properties; it is said to invigorate the wearer, allowing them to strike with all their might or cast their powerful spells without the need to rest, or help overcome hexes placed upon them by jealous foes. Whether that is true or not, few can say. But the Champions who survive the challenges of the Circle of Many are yet to claim the rewards they have reaped were inadequate.,",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/106578447_3070365689745582_8240330647383691299_n.jpg?_nc_cat=101&ccb=1-3&_nc_sid=730e14&_nc_ohc=EVun_V0sBKoAX8Gs4_C&_nc_ht=scontent-dfw5-1.xx&oh=5ed363c81702f3afcd6435c656b88924&oe=609B3BE2",
        "link": ""
    },
    {
        "name": "Kantran the Cyclone",
        "lore": "Boisterous and jovial, Kantra, nicknamed ‘Cyclone’ for her wild fighting technique, is among the most renowned mercenaries in Aravia. Though young, she had seen much in her life, and her origins inspired many a minstrel to compose ballads and songs of various degrees of propriety. For while she looks, fights, and behaves like a Barbarian from the East, Kantra is not, in fact, one of them.\nShe was born to a small, destitute noble family in Southern Tilshire. Her father, a dishonourable and greedy man, was largely to blame for the family’s troubles. His gambling habits quickly saw debts mount beyond what even a noble could manage, and he hoped that a suitable marriage would help him handle loans. All that remained was ensuring his daughter would be proper and obedient enough to accept whatever old moneybag offered the most for her beauty. \nKantra, as it often goes in these tales, would have none of it. She was always a free spirit, inspired by legends of warrior queens and noble knights, eager to learn the art of the blade. Though her father forbade it, the young noble sought out every opportunity that her backwater little town could provide - which were few and far between.\nThat could not go on forever; when tension finally erupted in violent conflict, Kantra fled her home and her father’s abuses. In retrospect, it was an unwise decision that could have led to her death. But fortune smiled upon her, and Kantra’s path crossed that of a Barbarian mercenary band. It comprised warriors born to the same Clan, whose honour meant more to them than the ransom a highborn captive could bring. They took Kantra in, taught her to fight, taught her to live as free as the spirits of the wind.\nThus the would-be warrior cast aside the trappings of her old life and embraced her adoptive culture with enthusiasm that never failed to amuse her mentors. She grew up strong, wilful, always eager for a challenge and far too keen on punching well over her head. One such scrap nearly cost Kantra her life; she picked a fight with a gaggle of orc sellswords over some minor insult one of those drunken louts uttered. By the end of it, the tavern was trashed, most orcs were dead or scattered into the town, and Kantra was down one eye. She was forced to flee before the insulted thugs had a chance to gather more of their friends to avenge their humiliation at the hands of the brash young human.\nNow, many stories of a hero’s origins will speak of how a brush with death teaches an arrogant warrior restraint and respect. For good or ill, Kantra is nothing like those heroes. She remains as foul-mouthed, as haughty, and as wild as ever, and the fight that cost her an eye is one of her favourite bragging subjects rather than a cautionary tale for the young. Albeit, in fairness, Kantra’s skills grew tenfold since that day, and she had bested countless challengers - certainly enough to solidify her reputation.\nAnd while it is a dangerous life she leads, always walking on a razor’s edge, always risking everything for the sake of excitement or pride, Kantra relishes every moment. Indeed, why would she change when a life of high adventure, full of dangers and glory, is more intoxicating than the finest Aravian wine?\n",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/107828103_3104025313046286_3177295513395967034_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=730e14&_nc_ohc=RX0aI844dWAAX9-xgKl&_nc_ht=scontent-dfw5-1.xx&oh=33b78443a58a8d6da7a04bc0bfac3106&oe=609A0761",
        "link": ""
    },
    {
        "name": "Gurptuk Moss-Beard",
        "lore": "The Durham Forest is a place of ancient magic and mystery, where many dangers await the unwary who venture beyond its borders. Vicious predators and man-eating monsters lurk in the perpetual dusk that shrouds Durham, ruthless Dark Elves prey on travelers, and vile Undead abominations make their dens in the twisted thickets. But there is a clearing at the very heart of the forest where a single old hut stands. Neither beast nor elf dare stray close to it, for they know the master of that place has little patience for unbidden guests and power enough to make sure their transgressions are punished in full.\nNo one, not even the elder sovereigns of the Dark Elves, knows when and how Gurptuk the Moss-Beard came to be in Durham. He simply was for as long as anyone could remember, making a living in the depths of the woods. Dozens of wild tales and myths surround his figure; some claim Gurptuk is, in fact, a fay, a guardian of nature and the true master of Durham; others believe he is a mad old shaman who made a pact with dark forces to grant him immortality in exchange for terrible sacrifices he must perform. Whatever the case might be, Moss-Beard holds the distinct appearance of an ogryn, albeit the bizarre wooden armor and amulets he carries may explain why he is mistaken for a forest spirit.\nHis behavior too does not fit a single pattern, and while some speak of the Moss-Beard helping lost travelers find their way back to the true and beaten paths, others recount blood-chilling stories of people butchered and used for unknown dark purposes. But there are those bold or foolish enough to seek Gurptuk out, for he is said to be a witch-doctor of immense power and his knowledge of poisons is almost without equal.\nOnce, an ambitious group of Dark Elf assassins sought to rid their kin of such a troublesome neighbor - and win glory for themselves along the way. They observed the Moss-Beard from afar, scheming and plotting to waylay him. When they struck, they did so with ruthless cunning and swiftness, firing poisoned arrows at the old druid in hopes of weakening him. But something went wrong.\nAlthough Gurptuk suffered many wounds, he did not fall as his would-be assassins expected, nor even stumble. Instead, he laughed. And while the attackers watched in horror, he stood tall and proud, a cloud of noxious spores rising from the mushroom growths that covered his body. Despite the poison coursing through his veins, despite the arrows in his limbs and back, Gurptuk the Moss-Beard strode forth and chanted in a tongue unheard, his staff sending bolts of arcane energy that burned through armor and flesh alike.\nThe assassins turned to flee, but there was nowhere to run or hide from Gurptuk’s vengeance. One by one they fell, and exactly what painful fate had befallen them is unknown.\nAfter that night, a row of fresh skulls could be seen decorating the fence that surrounded his hut. With no survivors to tell the tale, rumors and assumptions spread like wildfire, and Moss-Beard’s fearsome reputation grew. Now, even the most ambitious Dark Elf warrior knows to leave the druid well alone.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/97154972_2934875539961265_2979025540259774464_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=730e14&_nc_ohc=mk0YhvkSLfIAX_Wpltl&_nc_ht=scontent-dfw5-1.xx&oh=b06a9f2b3f20d24dda3a02e282bb62d1&oe=60988F88",
        "link": ""
    },
    {
        "name": "Turvold",
        "lore": "Turvold’s birth is shrouded in mystery. Some suspect he was born of a union between a hermit witch and a giant, a rumour that gave him the rather appropriate nickname “Giantson”. The rest of his youth is mired in tall tales, most spun by Turvold himself. He is said to have been discovered by a Norr hunting party in the forest depths as a child and adopted by one of them. His unnatural strength and resilience ensured that in due time he became the tribe’s most respected warrior.\nHe is said to have single-handedly slain a terrible Wyrm that terrorized the area for over a hundred years. It is in the Wyrm’s hoard that he found a mighty greatsword, infused with the chill of Winter by the great smiths of old.\nTaken by the desire to prove himself further, Turvold traveled the land as a mercenary for many decades and made a name for himself serving nobles of both Kaerok and Aravia. Though over a century old now, the blood of giants that runs through his veins keeps Turvold as mighty as he was in his youth.\nWisened by his age, he has become as cunning in battle as he is strong, now capable of exploiting the weaknesses of his enemies and delivering terrifying blows that make the ground itself quake in awe.",
        "image": "https://fb.watch/4QcqQOyDDS/",
        "link": ""
    },
    {
        "name": "Frostskin",
        "lore": "There are many creatures populating the harsh arctic wastes of Telerian North, curious and dangerous in equal measure. It is no surprise that trolls, resilient and stubborn as they are, have carved out a little niche in these inhospitable lands as well. And whereas other denizens of Teleria would often require their ingenuity and crafts to survive the perpetual cold, their natural affinity to magic allowed trolls to adjust in a far more drastic manner just as it did with their cousins dwelling in the mountains and the swamps to the south.\nRather than fight the cold, these trolls embraced it quite literally. Crystals of pure ice protrude from their skin, forming tough natural armour. Their skin is as cold as ice to the touch and, when the troll makes a conscious effort of channelling its inner magicks, that may be enough to encase even large creatures in shackles of ice. Frostskins often use this innate ability to hunt or to defend themselves against daring adventurers who happen to cross their path. Curiously, these trolls are also capable of channelling their power to stem bleeding wounds, albeit at the cost of numbing the limbs of whoever they help in this manner, for they never quite lose their chilling touch.\nThe numerous caves or burrows dotting the landscape allow Frostskins to find dwelling with ease. There they hide and gorge themselves away from the eyes of rivals and predators large enough to present actual danger. It is said Frostskins, like other trolls, are naturally drawn to items of magic and will often seek to hoard various arcane trinkets in their lairs. Many Champions venture into the polar deserts in hopes of recovering something of value. And many find themselves facing enraged Frostskins, who protect their ‘collections’ with the ferocity of a dragon.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/81245008_2631405153641640_6495635979292901376_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=730e14&_nc_ohc=104w29X3mJ0AX91V289&_nc_ht=scontent-dfw5-2.xx&oh=a3acc5bbf06dd965c588c79f260a7cfd&oe=609A2EDD",
        "link": ""
    },
    {
        "name": "Dwarfes",
        "lore": "Forgotten Champions Return\nDeep beneath the unforgiving mountains of Teleria, a war has raged, hidden from the eyes of the surface races. Driven by their greed for wealth and ancient secrets, the minions of Siroth surged through mountain passes and into near-forgotten tunnels, to reach the Dwarven Kingdom that lay hidden within.\nThe surprise and brutality of the attack saw the outer holdings quickly overrun, but the Children of the Stone answered swiftly. The next wave of invaders, and every one that followed after, crashed against stalwart Dwarven battalions. Demons, undead, and dark-hearted mortals - all fell before hammer and axe. \nAfter months of war and the loss of too many Dwarven lives, the forces of darkness were driven from the mountains. But Dwarves do not suffer tragedy lightly. Now they prepare to march on the surface to take back, in blood and gold, what is rightfully theirs.\n",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/67913052_2338224232959735_3616167549026172928_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=730e14&_nc_ohc=BtCGguLL-IkAX8lowzg&_nc_ht=scontent-dfw5-1.xx&oh=f8890b589587971b3d42d61a9bf52f64&oe=60983E76",
        "link": ""
    },
    {
        "name": "Skull Lord Var-Gall",
        "lore": "Aeons ago, before the rise of Humans and Elves, Lizardmen - or Dragonkin, as they were known at the time - were an empire unto themselves. Their domain stretched far and wide, and none could challenge them… But all that now lies in the past. Today, the tribes that survive are but a shadow of their former selves. Most have reverted to barbarism, many embraced their bestial nature. But there is still a vestige of greatness, a memory of that mighty empire remains. \nAmid the lakes that were once sacred to their ancestors, a tribe known as the Skullsworn yet dwells. The name comes from their custom of fashioning the skulls of their dead and the enemies they slay into helms to be worn by warriors - a sign of respect and a chance for the departed to fight in the name of the Great Dragon once more. Alas, their glory had waned with the ages, and the tribe lost ground to rivals and foreign invaders. Finally, the scions of the Dark One threatened the very heart of the Skullsworn domain. It was then desperate Lizardmen performed a ritual of sacrifice to awaken their ancient defender, one whose tread would shake the earth and before whom all foes would scatter. It was a desperate plea for help, their last hope - and their Progenitor answered.\nSkull Lord Var-Gall, once a mighty warrior in service of the Dragonkin Priesthood awakened, called forth by the blood of his descendants. His heart filled with rage when he realized how low the once-feared warrior caste had fallen and how vile invaders now sought to defile the very waters of the lakes under his protection. With a terrifying below he surged forth, calling upon the primordial magic that formed his very essence to raise his fallen followers from the dead. \nWith the newly-resurrected warriors bolstering their ranks and the revered Var-Gall leading them, the Skullsworn fell upon Siroth’s demons, driving them back with tooth and claw. More of them perished, laid low by unholy blades, only to be risen once more by the magic of their lord. Slowly, the tide turned. \nAs combat raged around him, Var-Gall smashed his way through the Demonspawn vanguard and deep into the heart of their army. Many enemies lay slain in his wake, but the Skull Lord’s fury would not be sated until the land itself drowned in the tainted blood of the interlopers. He cleaved and slashed through ranks upon ranks of spawn until their leader, a mighty Demon Baron stood before him.\nThe two were more than a match for one another, for the commander of Siroth’s minions was every bit as massive and brutal as the Skull Lord himself. He charged Var-Gall, effortlessly sweeping aside all the Skullsworn warriors who stood before him, and crashed into their Champion with enough force to utterly destroy a lesser mortal fighter. But Var-Gall would not be defeated so easily. Ignoring injury and pain, the Skull Lord rose to his feet once more and bellowed his challenge for all to hear. And so the two leaders clashed once more amidst the carnage, each ripping into the other with claw and blade, not giving a single step of ground.\nThe Demon Baron was a mighty foe in his own right, but Var-Gall had the strength of Ancestors empowering his every strike. This was no duel of skill and wit, both combatants fought like beasts, and Var-Gall proved to be the more vicious of the two. When he rose again, covered in terrible wounds but victorious, and raised the demon’s head for all to see, the outcome of the battle was decided.\nShattered by the loss of their commander, the Demonspawn withdrew in disarray. The Skullsworn pursued them without mercy and claimed many trophies that day. Var-Gall himself had the skull of the Demon Baron fashioned into a new ceremonial helm that marked his tribe’s victory in the sight of the Great Dragon. But rather than return to his ageless slumber, the Skull Lord had chosen to remain and tread Teleria once more. He would not let his warriors fade into obscurity again, and all those who dared invade the ancestral lands of the Lizardmen would know his wrath.\n",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/92262971_2854813667967453_8004473868871794688_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=730e14&_nc_ohc=iXV2kuQ9j84AX-amWJ4&_nc_ht=scontent-dfw5-1.xx&oh=adb84fe340797d51b3de46723bedbf4e&oe=609B1742",
        "link": ""
    },
    {
        "name": "Bad-el-Kazar",
        "lore": "Tales of a powerful necromancer known as Bad-el-Kazar have long been whispered across Teleria. He is a shadowy figure, a mastermind who prefers to act through pawns and unwitting servants rather than engage his foes in person. Even when forced to take to the field directly, he stays behind the lines of his “allies” and brings the power of terrible magic to bear. \nBad-el-Kazar’s origins are shrouded in mystery and much had been lost due to his own efforts. The necromancer prefers it that way, for the less his foes know, the easier it is to baffle and mislead them. But there is reason enough to believe that he had once been a White Mage, serving Lumaya and the Sacred Order. Over the years, the lure of forbidden knowledge had driven Kazar further and further down a dark path, and his thirst for power proved to be his undoing. \nSurely enough, when Kazar sought to unravel the mysteries of life and death, it was the vile art of Necromancy that he turned to. He collected a wealth of dark artifacts in secret, learning from them until his soul was as twisted and withered as the pages of his spellbooks. Alas, his intellect and power remained as keen as ever, and the Dark Lord Siroth did not waste an opportunity to gain such a powerful follower. His minions whispered into Kazar’s dreams, guiding him towards ever greater depths of damnation. \nIn the end, Bad-el-Kazar disappeared, wiping out as many traces of his past life as he could. Guided by visions, he travelled to the Brimstone Path where a great portal had laid forgotten for centuries. It would be part of Kazar’s grand role to ensure the portal would be reopened to allow the dread armies of Demonspawn into Teleria. In exchange, he would be granted life eternal and power beyond his dreams. \nKazar accepted the terms of the deal and set out into the mortal kingdoms, a herald of Siroth’s evil. But who can tell if the necromancer is truly a puppet of powers far beyond his reckoning, or if his cunning and ambition are directed at bringing his own nefarious schemes to fruition...\n",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/73074333_2484221621693328_6259304553426976768_n.jpg?_nc_cat=101&ccb=1-3&_nc_sid=730e14&_nc_ohc=5wJy_Gwn0s8AX9PrPbr&_nc_ht=scontent-dfw5-1.xx&oh=fc1ec8acaac5d66018ab7c04da7b3170&oe=609A3ADC",
        "link": ""
    },
    {
        "name": "Rae",
        "lore": "Among the scryers and shamans and astrologists of all colours, the gift of true foresight is a rare and precious thing. Many pursue it by means arcane, but that path can only lead to fleeting success, for the future is always in motion. Its shape is uncertain and fading, and no mortal eye is meant to witness it. Those who do manage to catch a glimpse are often left with more questions and vague interpretations than answers.\nThe truth is simple and disconcerting. Foresight is not something that can be learned through years of study, it is a gift given by Lumaya herself… or a prize that is won not but through terrible sacrifice. \nFor the Dark Elven sorceress Rae, a scion of an ancient and noble bloodline, this sacrifice was both spiritual and physical. But while she may have given up an eye for a taste of power, it can now gaze far beyond the veil of reality. This inner sight grows clearer when days wane and winter solstice creeps ever-closer. \nAnd now, at the turning point of the decade, Rae speaks of a new vision that fills her dream and waking hours. She speaks of the frozen wastes of the Winterlands, of the tundra that stretches south towards the Mountains of Despair. Of mysterious warriors that march through blizzards that would chill the blood of the living. They bring with them knowledge long-forgotten and skills unseen. Whoever these strangers are, it surely would be wise to secure their allegiance or, failing that, steel yourself and your Champions to battle against foes unknown.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/81693028_2664241577024664_5312033916972957696_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=730e14&_nc_ohc=hRWOyJeFc4YAX-qzsec&_nc_ht=scontent-dfw5-2.xx&oh=955208cf976e8e79e7025a43b45306f5&oe=60988D06",
        "link": ""
    },
    {
        "name": "Kael",
        "lore": "Origins: The Wayward Sorcerer",
        "image": "",
        "link": "https://www.facebook.com/notes/463250671298113/"
    },
    {
        "name": "Astralon",
        "lore": "It is known far and wide that Lumaya had created her faithful herald - the Arbiter - to serve as the protector of Teleria when she herself could not interfere in mortal affairs. Lesser known are the Champions of the young races, uplifted to immortality for their deeds, or angelic spirits brought into being to help the Arbiter fulfill her mission. Astralon is one such creature. He was the winged bearer of Lumaya’s word and the bringer of righteous wrath, whose name inspired terror in the hearts of the unholy.\nAs the Arbiter’s emissary, Astralon sought out heroes worthy of joining her cause in eons past. As her Strategos, he led mighty warhosts to do battle with the vile Demonspawn of Siroth in defense of younger races. Triumphant at every turn, he knew neither fear nor doubt, and duty was all that gave him joy; yet even an angel is powerless when his heart rebels against the mind.\nAt the height of the Great Wars - a time of realm-shattering conflict between the forces of Darkness and Light millennia ago - Astralon’s army clashed with the legions of Countess Lix, the Mistress of Plagues. For months the hosts were engaged in an intricate dance of maneuver and ruse, and neither general gained an advantage over the other. Brutal skirmishes erupted across the bloodied plains, and the Demon Countess taunted Astralon in missive her imps delivered almost daily.\nFrustrated and impressed in equal measure, Astralon committed his warriors to the pursuit and cut deep into enemy territory. Many a trap he had evaded through cunning of his own, many battles he fought against overwhelming odds only to triumph once more. Lix too grew to respect her foe begrudgingly and brought her strongest minions against him. It was all in vain. Driven as they were by their Strategos’ will, the warriors of Light proved stronger than whatever evil schemes she conjured. \nIn the end, Astralon cornered the legions under Lix’s command near the southern coast of Krokhan, and a decisive battle began. Both sides fought with vicious abandon, turning the tide of war several times before Astralon himself spearheaded the final attack that was meant to put an end to the Mistress of Plagues once and for all.\nTheir vanguards clashed, and mighty warriors perished on both sides while Astralon and Lix crossed blades amid the swirling melee. What passed between them is lost to legend, but it is known the angel proved to be stronger and triumphed after a long duel, albeit he too suffered terrible wounds and could barely stand. At that critical moment, Astralon could not bring himself to take his adversary’s life. Horrified, he realized that he had come to love the Countess over these months. Her wicked intelligence, her determination and strength, her eerie beauty struck a chord within him, and Astralon could not resist her. And yet he could not give in either, for he was a creature of Lumaya and it was his duty to protect the realms of mortals.\nThus Astralon forced his defeated foe to accept a new fate - that of service to the Goddess as one of her Champions - unwilling though Lix was at first. But he too could no longer serve as he did before. Recognizing his own weakness, Astralon abandoned his place at the Arbiter’s side and implored her to bind his soul to a Champion’s Shard. It was the only way he believed he could atone and stay close to the creature he had come to love. \nTo this day, Astralon nurtures a vain hope of truly redeeming Lix, while she likewise seeks to bring him into the embrace of Darkness. Neither succeeded for many thousands of years, but their twisted relationship endures - a strange alliance of sin and piety that only the mightiest of summoners can hope to bring to their cause.\n",
        "image": "",
        "link": "https://fb.watch/4Qe1LE0ixg/"
    },
    {
        "name": "Gurptuk Moss-Beard",
        "lore": "Many old mysteries lie buried amid the trees of the Durham Forest. Some wondrous and beautiful to behold, others dangerous, deadly, and best left forgotten. Beasts, brigands, ruthless Dark Elves all prey on the unwary, and only the mightiest adventurers can hope to survive if they stray from the beaten forest paths. Curiously, there is someone brave (or maybe insane) enough to make his home at the very heart of Durham.\nSome say he is a spirit of nature, a benevolent guardian of the woods whose hut is always open to the lost and the weary. Others swear he is a monster - hunger and malice given form, ever craving the blood of innocents. One thing is clear. Whoever this creature is, his power is immense.\nSo beware, o summoner, for only the bold can hope to unravel this mystery and recruit a new Champion to their cause.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/95857792_2925114760937343_4143006564178984960_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=730e14&_nc_ohc=1cbsi3x0C-YAX9gxtPO&_nc_ht=scontent-dfw5-1.xx&oh=8834da605af24a26d540deba277340c3&oe=609A3A12",
        "link": ""
    },
    {
        "name": "Elhain",
        "lore": "We continue exploring the origin stories of your favorite Champions! Today, we’ll see how Elhain met the Arbiter and pledged her bow to Lumaya.\nFollow the #RaidLore tag to learn more about the world of Teleria, and keep an eye for future comic releases!",
        "image": "",
        "link": "https://www.facebook.com/RaidShadowLegends/posts/3527890710659742"
    },
    {
        "name": "Tormin the Cold",
        "lore": "There are many songs of Tormin the King’s Hammer, Tormin Orcsbane, Tormin the Smith. Of his deeds and his bravery, of his cunning and wit, and of his loyalty. A hero of days long gone, he had been considered a mere fancy of Dwarven folklore by some sceptical scholars - a generalized character with traits taken from several historical figures, which would explain a long list of titles. But, in truth, Tormin indeed existed, and the tales of his adventures often have a seed of truth in them.\nBorn to a humble blacksmith - as is so very common among the Children of Stone, who revere the artistry of crafting metal - Tormin had begun learning the craft from the day he was strong enough to hold a hammer. He was talented and strong, though hot-blooded and oft found himself at odds with others. It was one such feud that led to Tormin injuring a rival smith’s apprentice and being taken by Jarl’s guards. His fate might have been bleak, were it not for frequent Orc raids that troubled the Jarl’s domain at the time. Every able-bodied warrior could be of use against the raiders, and thus Tormin found himself faced with a choice - be imprisoned for his crime or be conscripted into the militia. He had chosen the latter.\nThe saga goes on to describe Tormin’s service to the Jarl which lasted a decade and saw him rise from a mere foot soldier to a trusted Sergeant. He is said to have defended a narrow bridge across a cavern chasm alone, turning aside scores of orcish warriors. Several orc camps were raided and razed to the ground and bandits who led the raids slain by the Dwarven scouts under his command. His bravery had been enough to get him noticed by the Jarl, and when the King gathered an army to march alongside his human allies, Tormin too was called upon.\nIt was a stroke of luck, perhaps, that saw Tormin catch the King’s eye when he alone survived a bloody battle against the Undead and returned to the bulk of the army with a warning that would prove crucial to securing victory. Such resilience and determination were worthy of a true Dwarf, and Tormin was taken into the King’s own service.\nA particularly beloved tale speaks of Tormin being taken prisoner by Jotuns - a race of giants hailing from the Mountains of Despair - and using his cunning to escape. He had convinced the Jotun Chieftain that he could craft a weapon worthy of such an illustrious leader if given tools and materials to work with. The Chieftain, driven by his lust for power and well-aware of the fabled smithing talents of the Dwarves, agreed. Tormin remained true to his word and used all he had been given to craft a magic hammer of impressive power. Though rather than give it to the Jotuns, he had turned it upon them instead. The magic of Rimefire - as Tormin had dubbed his weapon - was unleashed and allowed him to fell many foes, baffling the rest and securing his escape.\nHe was hailed a hero once more when he returned home, Rimefire in hand, and tales of his adventure inspired countless songs praising Dwarven ingenuity and mocking the greed of the Jotun Chieftain. Tormin himself went on to serve the King for decades until his sudden disappearance far in the frozen North of Teleria. No one knows what exactly he was doing there, nor what happened. Some say Tormin was betrayed. Left for dead in a pool of his own freezing blood, he swore to seek justice and traded his soul to a malefic winter spirit that dwelled in the icy peaks of the winterlands. Others maintain that Tormin hunted down a powerful Lych lord but was mortally wounded. Only the intervention of Sir Nicholas allowed the Dwarven warrior to survive, though the cost was steep. Some even deny Tormin’s survival at all, claiming he had perished in the icy wastes, far, far away from mortal eyes, and that neither his remains nor his mighty weapon may ever be recovered.\nYet this old saga has been given new life recently, when scouts returned, terrified and frostbitten, from their mission beyond the Mountain King’s realm. They spoke of a terrible blizzard that enveloped their party and of a lone Dwarf who walked through that storm unharmed, silent and clad in frozen armour. He led the scouts down from the treacherous mountain and into valleys below, yet did not share a single word with them. Most importantly, the stranger wielded a mighty warhammer of silver and ice. Though he had disappeared without a trace when the task was done, this mysterious benefactor had caught the attention of the Dwarven’s monarch, and new, better-equipped parties are already being prepared to venture north and bring their long-lost brother back into the fold.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/78748644_2606062646175891_2342652626992103424_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=730e14&_nc_ohc=hSSXFsHFTUwAX_Txfxj&_nc_ht=scontent-dfw5-1.xx&oh=c11c1bc3285a06c72e1b5ac51d5b12a5&oe=609BF1ED",
        "link": ""
    },
    {
        "name": "Tormin the Cold",
        "lore": "Even among the great Dwarves of yore, whose sagas have echoed across the carven underground halls for centuries, Tormin, son of Bonur, is a name oft hailed above others. A scion of a humble smith, he had risen through service to his Jarl and stood among the King’s own champions. His adventures were many, his deeds mighty, and no bard can retell them in a single night. But there is one tale that always makes the eyes of young adventurers gleam with wonder.\nOnce, having lost his way in the Mountains of Despair, Tormin was captured by a vicious tribe of Jotuns and forced into labour. Though his strength was great, not even such a renowned warrior would stand a chance alone, so Tormin had to rely on his wit and cunning. He promised to craft a weapon of great power for the chieftain of the giants - if they brought him ingots of silver from the depth of the mountain and the blocks of frozen Aether, only found on the summits of the tallest peaks.\nEnthralled by the promise of such bounty, the Jotun chief agreed and ordered his tribesmen to deliver everything and anything that his prisoner requested. And so for a fortnight Tormin carved and forged the mythical elements, using every ounce of his skill and experience. Then, after weeks of backbreaking work, he finally held aloft a mighty hammer, its haft as cold as the touch of the Void itself. Yet it burned with arcane power, and Tormin had dubbed it appropriately - Rimefire.\nWhen the Jotun chief stepped forth to claim his prize, Tormin seized his chance and struck out against his captors! Such was the power of his hammer that it felled a dozen giants at once and turned a dozen more into statues of ice. Before the rest of the tribe’s warriors were upon him, Tormin struck the mountainside and brought down a great avalanche as he made his escape. \nIt is said that when Tormin disappeared amongst the craggy peaks of the Mountains of Despair to the far North decades later, Rimefire too had been lost. Ever since that day, countless adventurers dared the deadly mountain ranges in hopes of finding this weapon of legend. Until now, none have succeeded and many lost their lives. But the promise of glory yet calls to brave souls across Teleria...\n",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/79922808_2599359533512869_6360525885937811456_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=730e14&_nc_ohc=TZCWDd9u_jgAX9HnP1n&_nc_ht=scontent-dfw5-1.xx&oh=eae303a8f0727ce9e32b6cbefabdc489&oe=609AC7BF",
        "link": ""
    },
    {
        "name": "Dark Athel",
        "lore": "The battle horns are silent, the vultures gather for their bloody feast, and the clash of steel no longer echoes across the field. But for Athel, the battle is not over. \nA dark presence, unknown and yet so familiar, looms ahead. She senses that it may prove to be her greatest challenge!\n#RaidLore",
        "image": "",
        "link": "https://fb.watch/4QenSeg_ef/"
    },
    {
        "name": "Knight Revenant",
        "lore": "Teleria has existed for aeons, guarded by the Arbiter and her chosen Champions from the Shadow that would consume it, but largely left to develop without divine intervention. Mighty civilizations have risen and fallen, be it because of a cataclysm or their own hubris. Some are gone without a trace, some remain in folklore and legends. And some leave remnants of their past glories behind. \nWhen a host of Knights Revenant forced their way into the crumbling city, half-submerged into the ocean, they expected to find unplundered riches and Artifacts. What they found instead was a monstrous serpent and a hoard of strange glyphs that pulsed with ancient magic. And though these dark Champions succeeded in slaying the guardian beast, who knows what other horrors dwell in these cursed lands...",
        "image": "https://www.facebook.com/RaidShadowLegends/photos/2377474809034677/",
        "link": ""
    },
    {
        "name": "Dark Athel",
        "lore": "As a bloody battle between the champions of Teleria and the corrupted servants of Siroth comes to an end, Athel is about to face her greatest challenge yet. An upcoming video will delve into this story, and here is a small taste of things to come:\n---\nRavens circled above the field, moving in a swirling black mass. Their cawing, overwhelming and almost triumphant, rose to a crescendo somewhere overhead as Athel picked her way through the bodies of the slain.\nAttracted by the scent of blood that hung heavy in the air, these vultures did not take kindly to the interloper who dared distract them from their feast. And yet the young warrior pressed on. Past the forest of mangled spears and shattered swords, past the tattered banners that fluttered in the wind. Here and there, the wounded stirred and whimpered in pain.\nAthel hesitated, she would have abandoned everything to help those suffering soldiers now. Yet in doing so, she would have forfeited both their lives and her own. Opposite her, a figure stood alone, still as an onyx statue. Clad in a black cloak that almost seemed like it was weaved from the fabric of shadow itself, the stranger waited. Eyes unseen stared deep into Athel’s soul. She could feel it. The aura of sheer malice that radiated from this warrior was almost as palpable as the chilly bite of the evening breeze. One thing was clear beyond any doubt - this was no friend or ally.\nAthel approached, drawn to the shadowy silhouette by some unknown force. From there, she could see the eerie crimson light that danced along the blade of the stranger’s spear. Dark magic - Athel realized. Everything about this felt wrong.\n“Who are you?” She demanded firmly. “Show yourself!”\nThere was a moment of silence. Then, a soft, barely audible laugh that made Athel clench her teeth and tighten the grip on her weapon. Instead of an answer, the strange reached up to pull the hood off her face. What was underneath made Athel’s heart skip a beat in horror.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/60126736_2200718930043600_1949993058795782144_n.jpg?_nc_cat=102&ccb=1-3&_nc_sid=730e14&_nc_ohc=3tGxyj9SgGAAX_k3VHZ&_nc_ht=scontent-dfw5-2.xx&oh=38fe8f4bdf0de78a05bd77d279320d46&oe=609B8087",
        "link": ""
    },
    {
        "name": "Roshcard the Tower",
        "lore": "Nicknamed “the Tower” for his impressive height and his unyielding manner of defensive combat, Seneschal Roshcard is well known among the ranks of the Sacred Order and beyond. Despite his high rank he can always be found spearheading attacks and facing the gravest of dangers alongside his Brothers and Sisters. \nOne tale recounts Roshcard’s heroic actions during the siege of Dreadfang - an ancient ruin that had been turned into a mighty stronghold by a would-be Vampire Lord. Ignoring the odds, Roshcard set out with the vanguard of his army, personally leading the assault. When the siege towers finally broke through to the walls and the ramps crashed onto the battlements, it was the Seneschal who charged headlong into the hordes of ghouls and skeletal warriors. None could stand before his might, and the Undead were swept aside, tossed off the walls in droves with every swing of the holy warrior’s hammer.\nIt is said Roshcard’s weapon emanated pure light when he met the Vampire Lord in single combat and laid him low. With their master banished, the Undead creatures too collapsed and turned to dust. Roshcard was hailed as the Champion of Lumaya on that day no only by the Templars he led, but also the local townsfolk who had suffered greatly at the Vampire’s hands. Some even say that is when his monicker was truly born, though there is no way to know for certain.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/70660210_2436102276505263_1509991801262440448_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=730e14&_nc_ohc=KHVqb4WXskUAX86lswQ&_nc_ht=scontent-dfw5-2.xx&oh=65709326db9a5ac4edf3b9773f9094f9&oe=6099F12C",
        "link": ""
    },
    {
        "name": "Chicken",
        "lore": "The nobles of Kaerok have been known to take full advantage of the bounties their Southern lands offer. Poultry, chicken in particular, is often prepared with slices of lemon, starspice, and lavender butter. I've heard the more adventurous chefs stuff it with oranges. It gives the dish a unique sweet flavour that many foreigners find peculiar.\nI have personally witnessed a mercenary from the barbaric tribes start a brawl over his chicken being served with guavas. I cannot blame the poor man. The people of Kaerok have strange tongues. Nonetheless, a bowl of their classic rotisserie chicken is sure to provide any weary warrior with strength, vitality, and a particularly chirpy mood for the rest of the day. \n- Excerpt from the “Poultry of Teleria” by Berold the Epicure",
        "image": "",
        "link": ""
    },
    {
        "name": "Sir Nicholas",
        "lore": "Past the northernmost borders of Teleria, beyond where ice-bound fjords meet the cold seas; tales speak of a frozen waste where the sun dares not rise and none can dwell but Frost Dragons and Ice Giants...\nAll save one.\nHe is a mighty warrior who has been with us since Lumaya first birthed this world... and once a year, in the dark of winter, he descends upon our realm with his fearsome band of beasts and half-mortals to pass judgement.\nNo castle wall can stop him. No door can bar his way.\nHe sees you when you're sleeping, and he knows when you're awake.\nAnd this winter... he comes for you.\nPrepare yourself.",
        "image": "https://scontent-dfw5-2.xx.fbcdn.net/v/t1.6435-9/48393478_1978764222239073_6298430146420408320_n.jpg?_nc_cat=102&ccb=1-3&_nc_sid=730e14&_nc_ohc=daxdV7YEFkgAX84k0n8&_nc_ht=scontent-dfw5-2.xx&oh=ed5e98d3c72f05043916af86c6c55453&oe=60996D0D",
        "link": ""
    },
    {
        "name": "Angar",
        "lore": "A living legend, Angar is not only a warrior of great strength and courage but is also known for his sharp tongue. Perhaps a bit uncommon for an orc, he values victory in the battle of words just as much as a victory in the contest of arms.\nProvoking his foes into a mindless rage with barbed insults, Angar can easily make them forget about their tactics. While Angar himself prefers to keep a cool head in battle. He is known to gather grisly trophies such as skulls and bones of the slain. Some say it helps him to always remember the cost of men's folly and blind fury.",
        "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/58373528_2170307863084707_1750775205543804928_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=730e14&_nc_ohc=nb7kff5klHIAX9OnJuI&_nc_ht=scontent-dfw5-1.xx&oh=a4785c9e720d559d8e2d9340bce24151&oe=609A2A15",
        "link": ""
    },
    {
        "name": [
            "Fire Knight",
            "Ice Golem",
            "Fyro",
            "Klysuss"
        ],
        "lore": "Two thousand long years have passed since these mortal enemies doomed themselves through bloodlust and treachery.\n\n\nForever cursed, they stand eternal… awaiting those brave or foolish enough to seek their treasures.\n\n\nWill it be you?\n\n",
        "image": "https://cnt-forum.plarium.com/file.bmp?g=9f161b80-a4d2-4947-afc6-866456060ed8",
        "link": ""
    },
    {
        "name": [
            "Skavag",
            "Spider"
        ],
        "lore": "Many creatures haunt the secret places of Teleria – but some are best left forgotten.\n\nIn the lost places, the old places, abominations scuttle in the dark atop heaps of mildewed bone and tattered clothing. There amidst the rot and refuse, the glint of treasure beckons… and new warriors rise to answer its call.\n\nPrepare yourself.\n\n",
        "image": "https://cnt-forum.plarium.com/file.bmp?g=a2c8fe68-4f28-44c5-91bb-d40fc83040df",
        "link": ""
    },
    {
        "name": "Minotaur",
        "lore": "The sagas speak of one Queen Myra and her monstrous offspring.\n\n\nKept by his mother as a fitting end for court enemies and common criminals, its tormented howls still echo deep in the dark vaults of its prison. According to legend, those lucky few with the cunning to best the beast found themselves bestowed with untold skill and prowess in battle. Those that failed were never seen again…\n\n\nWhich shall you be?",
        "image": "https://cnt-forum.plarium.com/file.bmp?g=d359992a-4355-4e2c-955a-56ff93dceae3",
        "link": ""
    },
    {
        "name": "Barbarians",
        "lore": "From the windswept barbarian plains, they hear the call.\n\nFrom dark crypts and forgotten tombs, they shake off the mold of centuries.\n\nFrom frozen mountain peaks, the halls of men, and the palaces of elven nobles they gather...\n\nWhether holy or foul, great or small - none may deny the summons of the Arbiter.\n\nPrepare for their arrival.\n\n",
        "image": "https://cnt-forum.plarium.com/file.bmp?g=08b3c2a5-4869-4f89-a83b-5f83ca89d784",
        "link": ""
    },
    {
        "name": "Sethalia",
        "lore": "Lady Sethallia hails from the coast of the Land of Rebirth, South of the Castle of Kaerok itself. Her ancestral fief grants control of much of the province, making Sethallia a well-known face at court as well as one of King Tayba’s important vassals. Fiery-tempered and charismatic, she has earned as many enemies among the King’s bannermen as she did friends.\n\nHer brash nature is well known even among Sethallia’s own people, although it seems her soldiers have grown to adore and respect it. A widely-quoted story tells of her bravery when a small force of Kaerok knights fell into an orc ambush. Seeing a hulking orс chief fell a dozen of her men in that battle, Sethallia cut her way through to the beast and mocked him brazenly. The orc, who is said to have dwarfed even the tallest of King Tayba’s knights, abandoned the wounded soldiers in favour of trampling the foolish noble into the dirt. Yet for all his savagery he could not match Sethallia’s skill. Finally provoked into making a mistake, the orc chief soon found his throat pierced by a spear, and his kin broke and fled the field upon witnessing their leader’s defeat. Needless to say, Lady Sethallia’s reputation as a warrior and her popularity in the King’s army blossomed after that feat.\n\nFor all her recklessness, Sethallia is a capable leader that can both guide her fury to set enemy ranks ablaze with magic or direct her allies to sap away their strength in a relentless assault. But where enemies face naught but fire and wrath, Sethallia’s care has been known to miraculously heal even the most grievous of wounds.",
        "image": "",
        "link": ""
    },
    {
        "name": "War Mother",
        "lore": "An Aravian joke has it that the only thing tougher than an angry Ogryn would be his mother. And as the elves of Aravia had to deal with Ogryn tribes for centuries, one would have to assume they know exactly what they are talking about.\n\nNo less savage and freakishly strong than her more commonly seen male counterparts, the War Mother, as she is called, holds a position of unquestionable authority within her tribe. Though she is skilled at wielding a gigantic cleaver that can easily debilitate her foes, the War Mother’s knowledge of alchemy allows her to use crude but incredibly effective explosive casks in battle. Perhaps it was this innovative approach to combat that allowed this Ogress to become so successful.\n\nRenowned as a great beauty among her people, she is said to have a long line of suitors coming from among the most fearsome chieftains. Some evil tongues suggest that every single one ended up as the main course of a wedding feast without an actual wedding. Thus far, no scholar from the more civilized kingdoms risked interviewing the War Mother herself to find out the truth of the matter.",
        "image": "",
        "link": ""
    },
    {
        "name": "Altan",
        "lore": "Once a warrior of near legendary prowess among his people, Altan enjoyed a life of adventure and debauchery. Like many other Barbarians, he served as a mercenary, battled rival warriors for glory and bragging rights. Even as he grew older, Altan’s prideful nature did not abate.\n\nAnd though his strength began to wane, he still craved the same renown and the elation of battle. When accused of becoming old and weak, he did not just give the offenders a good thrashing but also vowed to face the dread dragon Hellrazor alone. Without a word, he gathered his arms and departed for the Beast’s mountain.\n\nIt is unknown what transpired in the Dragon’s lair, for Altan refuses to speak of it. Some say the Arbiter herself intervened and saved him from certain death. Whatever the case may have been, it was clear that Altan did not prevail - yet he did not perish either. When he emerged, the old Barbarian warrior appeared fused with dragonflame that will burn within him forever. He swore fealty to the Arbiter and her fight against the growing Shadow and served her chosen warriors ever since.",
        "image": "",
        "link": ""
    },
    {
        "name": "Adriel",
        "lore": "Even among the ranks of Chaplains of the Sacred Order, Adriel is known for her ardent faith and unflinching resolve. Where some priests prefer to tend to the spiritual wellbeing of their own warriors, Adriel can always be counted upon to join the vanguard. Her loud proclamations of contempt and promises of damnation have been known to demoralize many a foe, paving the way to easy victory for her allies.\n\nBut charisma is not Adriel’s only weapon. By Lumaya’s light, she can blind the enemy, sowing confusion and weakening their attacks. The same grace allows her to close wounds with but a touch and enchant her allies’ armour to reflect attacks back at those would seek to harm them.",
        "image": "",
        "link": ""
    },
    {
        "name": "Hexia",
        "lore": "Once a beautiful noble Lady of Kaerok, Hexia is said to have feared nothing but the relentless march of time. Knowing full well that her beauty will wane and rot away with age, she sought to prolong her youth through dark and terrible rituals. Some say she used the blood of young peasant women in hopes of preserving her body, others that she sacrificed anything and anyone, casting their souls into Siroth’s embrace in exchange for sorcerous secrets and eternal youth.\n\nSuch was her cruelty, that the people of her fief arose in rebellion. The castle was stormed and taken. Hexia herself had been dragged to a forest beyond the town walls and hanged on an old oak. Legend says that in her last breath, the vile sorceress cursed her former subjects and vowed vengeance.\n\nBut even death was not the end for her, as the blood rituals Hexia performed allowed her spirit to remain, possessing her dead body once more and exacting a horrible price upon the townsfolk that dared take everything from her. Whether or not that is the case, the castle and the town surrounding it have been devastated by plague not a month after Hexia’s execution and burned to a cinder to stop the disease from spreading.\n\nEven now, the burned-out ruins that sit upon a barren hill and are considered to be a blighted place by the locals. Some brave adventurers dare to stray into the ruined castle’s catacombs in search of the sorceress’ riches. The few that return in one piece speak in hushed whispers, warning all who would listen of a cruel banshee that jealously guards her former domain.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": "Taurus",
        "lore": "Though Skinwalkers at large lack the secrets of steel or alchemy to truly challenge the powerful nations of Teleria, ancient tribal lore and knowledge of the land allow them to improvise. Thus the Taurus, in addition to his brute strength, has access to potent poisons crafted by the tribe’s shamans any venomous component they can find - be it a corrupted plant or a giant spider’s powdered mandibles.\n\nSuch concoctions can be extremely virulent, if volatile and prone to poisoning the warrior using them as well as the intended targets. Though sheer animalistic toughness allows the Taurus to withstand the worst of the effects, having means of healing on hand is never a bad idea for any Warrior wishing to employ such tactics.",
        "image": "",
        "link": ""
    },
    {
        "name": "Hollow",
        "lore": "Siroth’s minions have brought the curse of undeath unto the world long ago, seeking to swell the ranks of their armies when the demons were sealed and imprisoned beyond Teleria’s realm. Shambling skeletons and risen corpses may not be bright, but what they lack in intelligence they make up for in sheer number. Yet, not all Undead are witless marionettes.\n\nSome servants of Shadow consign their souls and Shards to their dark masters, and after death retain a spark of their former self. And with it, their skills and talents. Once a master hunter, the Hollow remains dangerous with his bow even as a rotting corpse, capable of finding chinks in even the toughest armour.",
        "image": "",
        "link": ""
    },
    {
        "name": "Skirmisher",
        "lore": "Barbarian tribes are renowned for their ability to adapt to harsh conditions, be it their inhospitable land, or unfavourable odds on the battlefield. Sometimes, the sheer rage and fury that they are associated with are not enough, and cunning tactics must be applied. Thus the use of skirmishers, armed with bows or javelins, is not uncommon. These warriors appear out of nowhere, strike at any vulnerability they can find, and disappear like ghosts.\n\nThis Champion in particular has honed her talent to take advantage of an opportunity. She knows that denying an enemy’s advantage is crucial to ensuring victory. And so she will employ any means necessary to bereave the foe of enchantments and slow them down to let her allies seize the initiative.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": "Frostskin",
        "lore": "Commonly known as Frostskins, these ice trolls dwell in the snowy mountains and ice-covered plains of Telerian North. Yet as the Shadow grows and its corruption spreads across the land, many of them are forced to abandon their cavernous homes and either join their kin to form tribes or roaming bands, or seek to survive on their own.\n\nThe magic that flows through their veins does have visible effects, allowing Frostskins to chill anything they touch - often turning their foes to ice. But they are also capable of using that same magic to heal injuries, should they choose to, even if the process is as slow as the change of seasons in their frozen homeland.",
        "image": "",
        "link": ""
    },
    {
        "name": "Sir Nicholas",
        "lore": "Ancient legends from all across Teleria speak of a mighty warrior, whose life spans years beyond counting. He took first steps upon this land when the world was yet young, he stood alone against odds insurmountable, and felled twisted creatures would devour the sun itself. It was him who ventured beyond the barren tundra and into the ancient frozen wastes of Telerian North to break an army of Ice Giants that threatened to overwhelm the infant human kingdoms. Having slain the Giant King in single combat, he took the castle cut out of a glacier for himself and made it into a fortress dedicated Lumaya.\n\n\nSuch is the tale of Sir Nicholas, known under different names to the people of Teleria, but ever-present in their folklore. It is said that to this day he sits upon a throne among the towers of jagged ice and gazes upon the world through a scrying crystal gifted by the Arbiter herself. By his judgement do the righteous receive great boons, and the wicked - their just punishment. Though perhaps Sir Nicholas is not as omnipotent a force as some of the old tales paint him, it cannot be denied that many powerful villains disappeared without a trace on a Winter Solstice night...",
        "image": "",
        "link": ""
    },
    {
        "name": "Reinbeast",
        "lore": "An outcast among outcasts, the Reinbeast’s very survival is as much a miracle as it is a testament to his strength and determination. Born in the darkest depths of the Durkham Forest on a cold winter morning, he was immediately marked by the strange colour of his coat and a glowing red nose. All through his childhood, the Reinbeast had to fight all those who would see him cast out. Yet beatings and cruelty only hardened the poor creature and taught him to stand tall and proud no matter the hardship.\n\n\nBut on one stormy night, when the wind howled like a wounded dragon among the twisted and gnarled trees of Durkham, and a terrible blizzard swept the land, his fate was changed forever. Forced out into the night by his tribe’s chief on a fool’s errand that was no doubt meant to see him dead, the Reinbeast came across a most confusing sight. A sleigh full of strange items stood there, encased by ice, and a man clad in armour of silver and red worked tirelessly to fix the damage. A small pack of reindeers shivered at his side, cold and tired, no longer able to pull the heavy carriage. Though suspicious at first, the Reinbeast was moved by the pure light that seemed to be emanating from that mysterious human, and the care he showed in trying to help his exhausted steeds.\n\n\nHe approached, cautiously, and offered help in a broken Common tongue. To his surprise, the man’s own words boomed within his mind loud and clear, as if spoken by one of his own people. Sir Nicholas, as the strange introduced himself, was most grateful for the aid. And with the Reinbeast now placed in the lead, his own reindeers finally managed to free the sleigh and press on their way. With magic beyond imagining, they went across Teleria in a single night to reward the just and punish the wicked, with the Reinbeast’s glowing nose leading their way. It was no surprise that when offered a single wish for his selfless help, the Reinbeast asked to remain in Sir Nicholas’ service - and thus he has remained for centuries, pulling the mighty sleigh through blizzards and storms, and fighting at Sir Nicholas’ side when such a need arose.",
        "image": "",
        "link": ""
    },
    {
        "name": "Jinglehunter",
        "lore": "Once a modest mortal in the Elven kingdom of Aravia, the Jinglehunter led an honest life. He did others no wrong and sought nothing but to bring joy to one and all. Through his selfless dedication to others, many lives were improved, sometimes even saved. Never a true soldier at heart, he did nonetheless learn the art of the bow and would stand up to evil without fear in his heart.\n\n\nAnd it was this kindness that saved his own life and gave him a new purpose. Lost in the Mountains of Despair on the Winter Solstice, the hunter had almost abandoned all hope when the cheerful sound of jingling bells rose him from the frost-induced slumber. At first, he could scarcely believe his eyes, for tales of Sir Nicholas were well known to the High Elves, and the poor hunter thought it was all but a dream. But when Lumaya’s servant stepped onto the icy cliffs and the cold receded by his will alone, the Elf fell to his knees and gave praise to the Goddess.\n\n\nYet this miraculous rescue was just the beginning. The hunter’s heart was pure and honest, thus Sir Nicholas gave him a chance to serve Lumaya’s law and bring hope to all those who would accept Her light. Without hesitation, the Merry Elf accepted. Known as Jinglehunter, he now rides into the night with Sir Nicholas on ever Winter Solstice.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": "Frostbringer",
        "lore": "The figure of the Frostbringer, sometimes known as the Snow Maiden, does not appear in the tales of Sir Nicholas until just three centuries ago. Said to have been a warrior raised by the Sacred Order - one of the fabled Temple Maidens - she saw a vision of a great pillar of light rising above an ancient glacier and burning away the darkness. Upon waking from her sleep, the Maiden knew what she had to do. Having gathered her spear and armour, she ventured out into the frozen lands that lay beyond the walls of her Monastery to follow in the steps of the fabled Sir Nicholas.\n\n\nThe dangers were many, the foes - deadly. But with skill and faith, the brave young woman fought to overcome them all. She defeated Frostskin trolls that sought to turn the intruder back, purged the undead that rose from beneath the snow, guided by the Shadow’s dark will, and braved daunting mountains on the way to her goal. Not even the fearsome drakes were able to break her resolve.\n\n\nThen she saw it - the mighty fortress of stone and ice that rose above the horizon. Battered and wounded, she pressed on for no fatigue could stop her when the goal was in sight. Three days and three nights she walked, waist-deep in snow, and only reached the steps of the fortress when the full moon of the third night shone brightly overhead. There she collapsed, but the light of Lumaya’s servants cannot be extinguished so easily. Sir Nicholas himself stepped forth to lift the brave youth up, and with the Arbiter’s blessing, she was granted eternal life. Ever since that fateful night, the Frostbringer remains a loyal companion and a friend to all those in Sir Nicholas’ band of Champions.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": [
            "Venus",
            "Cupidus"
        ],
        "lore": "Bards and minstrels have spun many tales about love so pure, it overcomes death itself. While it is, indeed, the stuff of many a ballad (too many, perhaps) the Realm of Teleria had seen these wondrous tales come to life.\n\nOne particular legend speaks of a maiden so fair she caught a jealous eye of an evil Sorcerer, a servant of Siroth's dark will. The spells he weaved allowed him to entrance the maiden and entrap her in a distant stronghold. Fortunately, her faith allowed the maiden to break free and regain her will before the sorcerer's vile designs could be realized, yet she remained a prisoner under threat of imminent death were she not to accept the Sorcerer's advances.\n\nBut all was not lost, for her promised one, a noble Knight of great renown, rose up to the challenge. He fought his way through untold dangers and enemies uncountable before forcing the great gates of the dark keep open. There, the entire might of the Sorceror's magic was unleashed upon him. The Knight cut down hordes of Siroth's servants, ignoring his own wounds and striking the villain down with a single blow of his blessed sword. Though life ebbed away from his body by the moment, he chose to expend the last of his strength on proclaiming his love for the Maiden who was finally free.\n\nI was at that moment the Arbiter herself interfered. Though Lumaya may never guide the affairs of mortals, her faithful herald would not let a heroic deed driven by love as pure as that turn into tragedy. She used her power to save the dying Knight, yet such divine assistance did come with a price. Unable to live on without her beloved, the Maiden did not hesitate to swear her own soul to Lumaya’s cause. In turn, both she and her Knight were granted with life immortal.\n\nThere are many recountings of their adventures afterward, some contradicting each other, some - the stuff of fairy tales. Even their true names are lost to history, as is any proof that their origins are anything more than legend. Yet one thing is certain - wherever the mysterious lovers known as Venus and Cupidus appear, no darkness may stand before the fires of their passion. With her magic, and his trusty blade, the pair has saved lives beyond counting. Any warrior that gains the loyalty of both of these divine servants will find their force strengthened with the kind of purity only love that transcends mortal boundaries can bring.",
        "image": "",
        "link": ""
    },
    {
        "name": ["Belanor", "Zavia"],
        "lore": "Hatred is a powerful thing, one that is, perhaps, as hard as death to overcome. Yet even here love finds a way, the story of Belanor and Zavia. Cruel fate had them fight on different sides of one of the many conflicts between the High Elves of Aravia and the exiles known as Dark Elves. Still, even though the bloody fog of war, through hate, and through fury, these two souls were united.\n\nAs stragglers of a battle between the warring Elven factions, they were initially forced to survive an unwelcoming orc-infested desert together. The sheer adversity and the dangers they faced allowed them to see a person behind the mask of an enemy. The passion that was sparked then survived far beyond a temporary alliance of convenience. And, in the end, both Belanor and Zavia chose to escape together rather than continue the feud. Now seen as traitors and deserters by their former allies, the two of them had no choice but to live on the run.\n\nThey faced persecution, poverty, and mortal danger together. Finally, they were captured and sentenced to death for their crimes. Yet when the first light of dawn broke and the jailors arrived to take the fugitives to the scaffold, they were taken aback. The cell was locked and secured, not a single hint at how the captives escaped. The only thing they found were two feathers on the stone floor, one black as night, the other - white as Lumaya’s light. To this day no one knows what transpired on that night, though some, as they often do, attribute the miraculous escape to the Arbiter.",
        "image": "",
        "link": ""
    },
    {
        "name": ["Juliana", "Romero"],
        "lore": "\"But, of course, it is not just love that is marked by divine intervention or tragedy that is worthy of the minstrel’s attention. Those are merely good for the dramatic flair that those knights of the lute do so enjoy. More often than not, love overcomes obstacles that are less grand on a cosmic scale, yet no less difficult for the mortals who find themselves entwined.\\n\\nThe Sacred Order as a whole, while not necessarily enforcing a Vow of Chastity, does forbid its members from having families and heirs - a precaution to make certain positions of power within the Order pass on by right of virtue, not that of blood. Undue attachment is heavily frowned upon as well, outright forbidden in some of the stricter Divisions of the Order.\\n\\nIt is no surprise then, that the Knights Romero and Juliana had never thought of themselves falling in love. Romero, ever coolheaded and pious found himself at odds with the young and brash Juliana, whose skill with the blade and fiery zeal led her to many mortal perils that she, to the young Knight’s credit, honourably overcame. But a life full of battles does tend to make emotions run wild. In time, the two warmed up to one another’s “quirks”, learned to appreciate them even. Their eventual union, though it may never be formalized by marriage, remains true and tested. Neither did that union affect their relationship as comrades-in-arms, if anything it allowed the two Knights to fight as one. Where Romero’s natural cautiousness may lead to him losing momentum, Juliana’s brazen but no less skillful tactics ensure that their forces control the initiative. And where Juliana may begin losing herself in the heat of battle, Romero is always there to serve as an anchor of reason. To this day, they remain among the Order’s prominent warriors and are ready to bring Lumaya’s light wherever it is needed most.\\n\\n\"",
        "image": "",
        "link": ""
    },
    {
        "name": ["Fenax","Tallia"],
        "lore": "Sometimes love blossoms early, and remains in the hearts of those touched by its warmth for the rest of their lives. Such is the tale of Fenax and Tallia. He was the son of a destitute noble, serving in the household of Tallia’s father. She - a cherished heiress. Though they have sworn to marry one another as children, no one had taken that vow seriously. And by the time Tallia’s father realized that this was more than childish games, that their love was not fading, it was far too late. The girl was far too headstrong and wild to be cowed into obedience, and the aging Lord had come up with a cunning and dark plot.\n\nFenax, then a squire, was sent with an “important message” to a neighboring bannerman. Alone with no escort, of course, as messengers had to travel light and swift. By the Lord’s design, a group of orc raiders was meant to ambush and slay Fenax - a tragedy to be sure, but one that his daughter would forget in time. Unfortunately for the Lord, he failed to take Fenax’s wit into account. Though indeed ambushed and brought low, he managed to convince his captors that he was, in fact, the heir of an important baron who would pay the savages handsomely. The greedy brigands were quick to drag him off to the camp instead, hoping to fool the Lord and gain both rewards.\n\nAnd when the searching party that went after Fenax upon him “suddenly” going missing on the road, Tallia’s father became concerned. He ignored his daughter’s pleas to send a group of men-at-arms to rescue her beloved from the orcs, who left plenty of traces to be identified. The Lord refused in anger, yet once more he had miscalculated. Furious, Tallia escaped the castle to mount a rescue on her own.\n\nA dangerous venture, to be sure. But fate was not always cruel. A Sacred Order patrol came across the young Lady, their Sergeant a man of honour and piety that did not shrink away from his duty to protect the innocent. With their help, Tallia managed to find and free Fenax from the raiders after a vicious battle in which she too was baptised by fire.\n\nThough after a loving embrace was shared and words of comfort were spoken, the Tallia could not help but wonder what was so important that her beloved had to risk his life to deliver. She unsealed the letter only to devoid of a single drop of ink. But it was not needed, the empty parchment spoke of her father’s betrayal louder than any words could. Hurt and furious, the two young lovers did not, however, let themselves be broken. Unwilling to return to the man that would see them separated so cruelly, they both swore an oath to join the Order and dedicate their lives to Lumaya, an oath that they have carried out with honour against servants of darkness beyond counting - together.",
        "image": "",
        "link": ""
    },
    {
        "name": ["Atur", "Kallia"],
        "lore": "Even those that live the lives full of hardship and primal strife among the Barbarian tribes are not immune to love. Atur, one of the mightiest warriors of his tribe, has always been a vain and arrogant man. He had every right to be proud, of course, for none could face him in a battle of equals and walk away victorious. None, until he met Kallia, whose prowess and ability to fly into relentless fury are as immense as her beauty.\n\nNeither of them truly remembers what sparked the conflict between them, both will, of course, blame their other half. Regardless of the truth of the matter, an argument went out of control, and a battle of words, in which even Atur himself admits he took a thorough thrashing, turned to fisticuffs. Here, their passion for a fight was evenly matched and soon turned to passion for each other.\n\nThough Barbarians are not exactly sophisticated, if not outright crude, by the standards of Kaerok or Aravia, Atur’s and Kallia’s relationship still blossomed into something sweet and loving… in its own way. It is certainly as strong as the mountains that surround their home, and as wild as the sandstorms that sweep the Deadlands.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": ["Harrier", "Hospitaller"],
        "lore": "\"Even those that live the lives full of hardship and primal strife among the Barbarian tribes are not immune to love. Atur, one of the mightiest warriors of his tribe, has always been a vain and arrogant man. He had every right to be proud, of course, for none could face him in a battle of equals and walk away victorious. None, until he met Kallia, whose prowess and ability to fly into relentless fury are as immense as her beauty.\\n\\nNeither of them truly remembers what sparked the conflict between them, both will, of course, blame their other half. Regardless of the truth of the matter, an argument went out of control, and a battle of words, in which even Atur himself admits he took a thorough thrashing, turned to fisticuffs. Here, their passion for a fight was evenly matched and soon turned to passion for each other.\\n\\nThough Barbarians are not exactly sophisticated, if not outright crude, by the standards of Kaerok or Aravia, Atur’s and Kallia’s relationship still blossomed into something sweet and loving… in its own way. It is certainly as strong as the mountains that surround their home, and as wild as the sandstorms that sweep the Deadlands.\\n\\n\"",
        "image": "",
        "link": ""
    },
    {
        "name": ["Seducer","Temptress"],
        "lore": "Where Lumaya brings us the purity of love, Siroth places his bets on the pure carnal desire. He tempts with excess and indulgence, pulling more and more willing servants into his net wherever he can. Such was the fate of a young noble of Kaerok, vain and greedy, he wished for nothing more than to better his position in power and lot in life. By the magic of Siroth’s necromancers, and by his own dark deeds he was granted a vampire’s “kiss”, turning into one of the undead beasts himself. But his pact with the Shadow stood firm, for the noble was allowed to retain his humanly looks that he so adored - for a time, at least.\n\nOne can only imagine this wicked Seducer’s shock and surprise when he was faced with another servant of Siroth, known as the Temptress. A child of a vampire and a mortal woman, she was as vain and self-assured as he was himself. And throughout all his attempts to gain the upper hand, the Seducer only succeeded in catching himself in his own trap. For even the darkest heart can sometimes be illuminated by Lumaya’s light, and he found himself hopelessly in love and at the whims of the woman he sought to outdo.\n\nStill, it may not be such a horrible fate in the end, for despite their mutual viciousness and less than savoury practices, the two of them do go together as well as a werewolf and a full moon. That connection is hard to deny, and it overcomes even the deeply ingrained selfishness that both of them were so known for.\n\n",
        "image": "",
        "link": ""
    },
    {
        "name": "",https://plarium.com/forum/en/raid-shadow-legends/670_news/116425_new-champions-released-0-12-2-2/
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
    {
        "name": "",
        "lore": ,
        "image": "",
        "link": ""
    },
]