[
    {
        "image": 1,
        "text": [
            "Eleven generations of peace had reigned between the Kingdom of Kaerok and the Realm of Aravia -",
            "a peace now shattered by King Tayba's brutal campaign of expansion into the neutral lands between the two kingdoms"
        ]
    },
    {
        "image": 2,
        "text": [
            "Once revered as a pillar of justice, King Tayba had imposed crushing taxes to finance his war with his former ally, bringing desolation and ruin upon his own people.",
            "Had the king lost all reason?"
        ]
    },
    {
        "image": 3,
        "text": [
            "On the orders of the Arbiter, the Company set out to persuade him to renounce his folly and wayward policies.",
            "Even if it meant storming the very gates of Kaerok Castle…"
        ]
    },
    {
        "image": 4,
        "text": [
            "Having overcome the Castle Guard, the Company Leader called to mind how the Banner Lords had cried out their allegiance to their King… but also to Siroth.",
            "Was the King's warring folly prompted by the will of the Lord of Darkness?"
        ]
    },
    {
        "image": 5,
        "text": [
            "Upon interrogation, a fallen Knight confessed that the King had not been seen at the Castle for many a month.",
            "His orders were being relayed by messenger from his encampment on the eastern front.",
            "This meant only one thing – the Company would have to pass through the war-torn City of Arnoc."
        ]
    },
    {
        "image": 6,
        "text": [
            "The once glorious city of Arnoc had fallen into ruin, famine and great sorrow.",
            "Peopled by desperate refugees, it had become an unclean place made darker by unknown horrors spawned in the encroaching Shadow.",
            "To go through it safely would take days - to go round it much longer. So the Company agreed to pass beneath it.",
            "They would venture into the foul city sewers, albeit risking the known danger of intruding on the territory of the lizardmen…"
        ]
    },
    {
        "image": 7,
        "text": [
            "After dispatching the lizardmen tainted by the Shadow, the Company waylaid a messenger bearing a missive from the King.",
            "They demanded that he direct them to the royal encampment."
        ]
    },
    {
        "image": 8,
        "text": [
            "Trembling for his life, the emissary pleaded that he knew nothing of such a camp.",
            "He had only ever received the sealed messages from a hooded knight at the catacombs of the temple of Narbuk.",
            "Emerging from the sewers, the Company set their compass north-eastward and began a long and arduous trek to the catacombs."
        ]
    },
    {
        "image": 9,
        "text": [
            "At last, they arrived at Narbuk where the temple was now consecrated to the cult of Siroth.",
            "Guided by their torches, they entered the catacombs where the wind howled with the anguished screams of the restless dead.",
            "As they sank deeper into the vaulted galleries, a voice on the wind became ever more distinct, now echoing words of protest, now prayers to Lumaya, the Goddess of Light."
        ]
    },
    {
        "image": 10,
        "text": [
            "The Company crashed into a chamber to find King Tayba strapped to a chair, his captors forcing a brew down his throat.",
            "They made short work of the aggressors then cut the King from his binds."
        ]
    },
    {
        "image": 11,
        "text": [
            "\"I have been bewitched,\" he began in rasping breaths, \"forced to declare war on Aravia...\"",
            "Then, handing them his royal signet, he said:",
            "\"Ask Queen Eva forgiveness for my forced betrayal… thank her for giving refuge to my people… and request her help to find the cause of this... this Shadow…\""
        ]
    },
    {
        "image": 12,
        "text": [
            "To gain entrance into Aravia, they would have to pass through the dark wood to Felwin's Gate.",
            "After a three-day trek, they reached the edge of Durham Forest, home of the Dark Elves.",
            "The Elves promised safe passage to those who would pay the toll.",
            "Showing them the signet of the King, the Company claimed right of way as bearers of the monarch's word.",
            "But the Dark Elves recognized neither King nor Queen, and attempted to take their toll in blood..."
        ]
    },
    {
        "image": 13,
        "text": [
            "The ugly truth of the Dark Elves was now known.",
            "Preying on the desperation of the refugees, they had offered two paths –",
            "the rich man's path, offering safe passage to Felwin's Gate - and the poor man's path… leading to the belly of the Dragon."
        ]
    },
    {
        "image": 14,
        "text": [
            "The Company blazed ahead to meet the elven Queen of Aravia, an ancestral ally of Kaerok.",
            "Known for her exceptional beauty, she was also a famed mistress of the old magic.",
            "So our heroes joined the torrent of hopeful exiles traveling eastward, to the promise of sanctuary among the High Elves."
        ]
    },
    {
        "image": 15,
        "text": [
            "Arriving at the snow-clad moor that sloped down to Felwin's gate, the Company surveyed the grim scene before them…",
            "A multitude of half-starved refugees:",
            "human folk, lizardmen, elven… the many peoples of Teleria, all camped in the frozen mud outside the battlements of the great gate, now barred.",
            "Ogryn and Skinwalker guards were denying them entry, telling them to clear off back to their homelands.",
            "The Company agreed to force their way through and unbar the passage."
        ]
    },
    {
        "image": 16,
        "text": [
            "They emerged victorious on the other side, and opened wide the colossal gate to let through the multitude.",
            "Amid great acclaim, the Company followed the road north toward the Palace of Aravia"
        ]
    },
    {
        "image": 17,
        "text": [
            "But before leaving the gate, a wounded Skinwalker seized hold of one of them and growled:",
            "\"See what you do, not good! We bar gate for reason. None can help them now…\""
        ]
    },
    {
        "image": 18,
        "text": [
            "Elven lords and ladies welcomed the travelers with honey cake and mead.",
            "They told them they would be led to their new home on the other side of Tilshire.",
            "Wasting no time, the Company hailed the Elven Guard to demand audience with the Queen.",
            "They offered to give her news of her friend and ally, King Tayba.",
            "The guard promptly returned with his chief who said, perhaps too affably:",
            "\"The Queen bids you welcome and friendship. She awaits you in her rooms.\"",
            "Our heroes advanced nonetheless with caution into the magnificent palatial hall."
        ]
    },
    {
        "image": 19,
        "text": [
            "They reeled in horror at what they found.",
            "Having exchanged the grace of the Eldar for the dark power of the Shadow, the Queen had mutated into a malicious sorceress.",
            "It was she who had betrayed the King, had fomented the war between Kaerok and Aravia...",
            "But to what end? What bargain had she struck?"
        ]
    },
    {
        "image": 20,
        "text": [
            "The Company now realized that the Skinwalkers had barred Felwin's Gate for good reason!",
            "Donning their cloaks, the heroes fled the palace.",
            "They joined the refugees travelling under the escort of the Sacred Order, to uncover what dire fate Queen Eva had laid down for them."
        ]
    },
    {
        "image": 21,
        "text": [
            "Stepping inside the township of Tilshire, the Company realized they had entered a trap, for the gates were slammed shut and barred behind them!",
            "The people - visibly entranced - were herded by Orcish guards to an inner court where Bad-el-Kazar, the dark Necromancer, was lording his power with the scepter of Siroth.",
            "Sensing the presence of stronger spirits, the Necromancer suddenly roared out:",
            "\"Guards! Arrest them! They are the Queen killers! Give no quarter should they resist!\""
        ]
    },
    {
        "image": 22,
        "text": [
            "The Company were in two minds. Should they risk tailing the Necromancer knowing they were outnumbered by the Sacred Order?",
            "Or should they cut through the treacherous mountain and take him by surprise at Valdemar Strait?",
            "Their dilemma was soon resolved by the circling presence of a great white eagle.",
            "It carried a message from the Arbiter telling them to make haste, that a Dark Mass was in preparation in the Deadlands."
        ]
    },
    {
        "image": 23,
        "text": [
            "So our heroes took the shorter but perilous mountain route.",
            "However, slowed in their tracks by a terrible blizzard, they arrived at Valdemar Strait as Bad-el-Kazar set sail."
        ]
    },
    {
        "image": 24,
        "text": [
            "Our heroes commandeered a fast ship and gave chase sailing three sheets to the wind.",
            "They were soon coursing in the wake of the enemy vessel.",
            "And, as the sun touched the horizon, they came broadside and boarded for a final confrontation with Bad-el-Kazar."
        ]
    },
    {
        "image": 25,
        "text": [
            "As Bad-el-Kazar crashed to the deck, a black book of spells tumbled from his gown.",
            "It bore arcane writings and an image of a horrifying ritual that was to begin with the dark mass."
        ]
    },
    {
        "image": 26,
        "text": [
            "Meanwhile, freed from the Necromancer's somber grip, the surviving knights of the Sacred Order were released from their demonic trance.",
            "A knight by the name of Kenric begged forgiveness for his Order's wrongdoings while under the Necromancer's yoke.",
            "He swore to restore their honor, and to save the bewitched folk from committing their shards to Siroth."
        ]
    },
    {
        "image": 27,
        "text": [
            "The hot, barren Deadlands were littered with ruins that bore witness to an erstwhile time when this land was fertile - before the Brimstone Dragon came and scorched the earth.",
            "After three days of fighting rabid beasts and barbarian patrols, the Company at last came to the ancient temple of Lumaya, now the destination of a dark ritual.",
            "Folk of every race were being driven in droves by Barbarians through the great temple gates to the sound of a deep, throbbing drone."
        ]
    },
    {
        "image": 28,
        "text": [
            "The Company announced to the multitude that Bad-el-Kazar the Necromancer was dead.",
            "But to their horror, as the incantation to Siroth resumed, they realized the souls of the congregation were still corrupted."
        ]
    },
    {
        "image": 29,
        "text": [
            "It was then that the Arbiter appeared with news from the Knights of the Sacred Order.",
            "They were assembling at Godfrey's Crossing in a final bid to destroy the Demon Priests of the Hallowed Halls.",
            "\"Go forth, and make haste, brave Champions,\" she intoned, \"I will stay and purify these souls!\""
        ]
    },
    {
        "image": 30,
        "text": [
            "At Godfrey's Crossing where the Deadlands met the gorge of the Hallowed Halls, they came upon a horrific sight to behold.",
            "The remains of a fallen army were scattered on the far side of the bridge that separated the two territories.",
            "Realizing the Sacred Order must have fallen into an ambush, the Company proceeded with great caution to the crossing."
        ]
    },
    {
        "image": 31,
        "text": [
            "They passed to the other side where the army of the Sacred Order had been decimated.",
            "One of the heroes picked out Kenric among the dying."
        ]
    },
    {
        "image": 32,
        "text": [
            "He called his brothers in arms around him, and all four fell to one knee.",
            "\"O valiant knights, in your crusade against evil you have redeemed your Order,\" he hailed.",
            "He then lifted his eyes to the sky. \"Fear not, noble Lords. May your souls ascend to the light of Lumaya!\"",
            "The Company then pressed on, arms at the ready, toward the Hallowed Halls to claim their vengeance."
        ]
    },
    {
        "image": 33,
        "text": [
            "Upon arriving at the Hallowed Halls, to the great surprise of our valiant heroes, the chief of the Knights Revenant held out a hand in friendship.",
            "\"Great warriors,\" he bellowed, from the hall steps, \"let us join hands in blood! Your valor will receive far greater reward in the design of Siroth than in the failing light of Lumaya!\"",
            "The spell of the Shadow was at its most potent in these halls.",
            "But our heroes, with hearts still pure and noble, remained loyal to the righteous Light and offered only one answer…"
        ]
    },
    {
        "image": 34,
        "text": [
            "\"Mortal scum!\" roared the Demon Priest as he prepared to deliver his final assault.",
            "\"Dead heroes cannot change the fate of this world!\"",
            "But, in a tremendous blaze of might and fury, the Company swiftly dealt a crushing blow."
        ]
    },
    {
        "image": 35,
        "text": [
            "As he lay mortally wounded by the Fires of Hell, in a strange, demonic voice, he howled:",
            "\"Fools! You do not see what I see...\"",
            "Then, in one last fiendish effort, he thrust out a hand and conjured a vision in flames of hellfire.",
            "It was the image of their death!"
        ]
    },
    {
        "image": 36,
        "text": [
            "Was the Demon Priest's sinister prophecy but a sham to prevent them from blazing a trail to the source of evil?",
            "Whatever the outcome, our four Heroes had no choice but to approach the Brimstone Path that led to the very source of the Shadow.",
            "Still they strove onward, battling their way through hellfire to the Brimstone Gate.",
            "This, the portal of Siroth, was sucking the living light from Teleria.",
            "Here they would have to end the corruption and restore the balance between the forces of darkness and light..."
        ]
    },
    {
        "image": 37,
        "text": [
            "By the light of Lumaya, the Company vanquished the guardians of Siroth and the fell demon Kivos.",
            "But alas, it soon became clear that the Priest's prophecy would be fulfilled!",
            "For only the combined force of their shards could unleash enough power to seal the dark portal.",
            "Our heroes bravely stepped forward and, together, offered the ultimate sacrifice to cast out the Shadow from the world!"
        ]
    },
    {
        "image": 38,
        "text": [
            "But wait, O Champion…  the story endeth not here.",
            "For the portal will open again, Siroth will return, and the Shadow will loom larger.",
            "Until that day comes, return to Teleria.",
            "Hone your skills, and seek out new champions.",
            "You will need them ALL soon enough..."
        ]
    }
]